#include <iostream>
#include <ctime>
#include <cstdlib>
#include <fstream>

using namespace std;

int random(int d){
    srand(time(0));
    int x=rand()%d+1;
    return x;
}

    int main(){
    int ans;
    cout << "คุณอยากจะปรึกษาเราเกี่ยวกับเรื่องความรักใช่หรือไม่" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณเลือก:" ;
    cin >> ans;
    if(ans == 1){
        cout << "ก่อนอื่นเราจะอยากขอทราบสถานะของคุณก่อนว่าคุณโสดหรือมีแฟนแล้ว ?" << endl;
        cout << "[1]โสด [2]มีแฟนแล้ว" << endl;
        cout << "คุณเลือก:" ;
        cin >> ans;
        if(ans == 1){
            cout << "หากว่าคุณยังโสดอยู่แล้วคุณมีคนในใจอยู่แล้วหรือยัง" << endl;
            cout << "[1]มีคนที่ชอบแล้ว [2]ยังไม่มีคนที่ชอบ" << endl;
            cout << "คุณเลือก:" ;
            cin >>ans;
            if(ans==1)
            {
                cout << "คุณมีคนที่ชอบแล้วใช่ไหมเอาละคุณอยากจจะให้เราอะไรดี"<<endl;
                cout << "คุณอยากให้เราช่วยในทำให้เขาสนใจในตัวคุณเหรอ อยากเข้าหาเขา"<<endl;
                cout << "หรือความสัมพันธ์ของคุณกับคนที่คุณชอบอยู่ในระดับที่คุถณสามมารถขอเขาเป็นแฟนแล้วแต่คุณยังรู้ว่าต้องทำอย่างไง"<<endl;
                cout << "คุณอยากให้เราช่วยเรื่องอะไรดีละ"<<endl;
                cout << "[1]อยากเขาสนใจในตัวคุณ [2]อยากจะเข้าหาเขา [3]อยากบอกชอบ"<<endl;
                cout << "คุณเลือก:" ;
                cin >> ans;
                if (ans==1)
                {
                    cout << "การที่คุณอยากให้เขาสนใจในตัวคุณนั้น"<<endl;
                    cout << "เราก็อยากจะขอถามคุณว่าคุณพร้อมที่จะพัฒนาตัวเองไหม"<<endl;
                    cout << "[1]พร้อม [2]ไม่พร้อม"<<endl;
                    cout << "คุณเลือก :";
                    cin >> ans;
                    if (ans==1)
                    {
                        /* code */
                    }else if (ans==2)
                    {
                        /* code */
                    }else{
                        
                    }
                    
                    

                }else if (ans==2)
                {
                    cout << "การที่คุณจะเข้าหาคนที่คุณชอบนั้นมีวิธีที่หลากหลาย ต่อไปนี้คือบางวิธีที่อาจช่วยให้คุณเข้าหาคนที่คุณชอบได้:"<<endl;
                    cout << "พูดคุยอย่างเปิดเผย: เลือกเปิดตัวตนของคุณให้คนที่คุณชอบรู้จัก พูดคุยเกี่ยวกับความสนใจ, ความฝัน, และประสบการณ์ของคุณ."<<endl;
                    cout << "สร้างโอกาสในการพบกัน: หากมีโอกาสในการเข้าร่วมกิจกรรมหรืองานที่คนที่คุณชอบกำลังเข้าร่วม, มีโอกาสที่คุณจะพบกันและมีโอกาสในการทำความรู้จัก."<<endl;
                    cout << "แสดงความน่ารัก: การแสดงท่าทางและพฤติกรรมที่น่ารักสามารถทำให้คนอื่นรู้สึกถึงความเป็นมิตรและใกล้ชิด";
                    cout << "พูดเพราะหรือมีทักษะในการสื่อสาร: การมีทักษะในการสื่อสารที่ดีสามารถช่วยให้คุณสามารถแสดงความคิดเห็นและความรู้สึกของคุณได้อย่างชัดเจน"<<endl;
                    cout << "สร้างความมีเสน่ห์: การมีทักษะทางสังคมและการแสดงอารมณ์ที่เชิดชูสามารถทำให้คนอื่นรู้สึกถึงความมีเสน่ห์ของคุณ"<<endl;
                    cout << "ช่วยเหลือและเป็นที่ต้องการ: การแสดงความกรุณาและเป็นที่ต้องการสามารถสร้างความประทับใจที่ดีให้กับคนอื่น ๆ"<<endl;
                    cout << "รักษาความสุขในตนเอง: การมีความสุขและมีสมาธิในตนเองสามารถทำให้คนอื่น ๆ รู้สึกดีในการอยู่ร่วมกับคุณ"<<endl;
                    cout << "ให้สัญญาณทางด้านกายภาพ: การให้สัญญาณทางด้านกายภาพอาจช่วยให้คนที่คุณชอบเข้าใจถึงความสนใจของคุณ."<<endl;
                    cout << "ใช้สื่อสังคม: ในโลกที่เชื่อมต่ออยู่กันมากขึ้น, การใช้สื่อสังคมออนไลน์สามารถช่วยในการสร้างความรู้จักและสื่อสาร."<<endl;
                    cout << "ขอความช่วยเหลือหรือคำแนะนำ: ถ้าคุณมีความสนใจในคนที่คุณต้องการเข้าหา, ลองขอความช่วยเหลือหรือคำแนะนำในเรื่องที่เขามีความรู้."<<endl;
                    cout << "เข้าใจและรับฟัง: ความเข้าใจและการรับฟังต่อความคิดเห็นและความรู้สึกของคนที่คุณชอบสามารถสร้างความสัมพันธ์ที่ดี."<<endl;
                    cout << "อย่าเร่งเร้า: ให้ความสนใจของคุณเติบโตและพัฒนาไปพร้อมๆ กับความเข้าใจที่ลึกซึ้งเกี่ยวกับคนที่คุณชอบ."<<endl;
                    cout << "จำไว้ว่าไม่สมควรทำตัวไปตรงกับคนเพื่อให้ชอบคุณ แต่ควรเป็นตัวของคุณเองและเพิ่มพูนทักษะที่ทำให้คุณมีความเป็นมิตรและน่าสนใจในสายงานของคุณเอง."<<endl;
                    cout << "และจงจำไว้ว่าการสร้างความรู้จักและความสนใจในส่วนของอีกฝ่ายมักจะเป็นเรื่องที่ต้องใช้เวลา และอาจจะไม่มีคำตอบที่แน่นอนในการทำให้คนนั้นชอบคุณ ควรมีความไว้วางใจและตั้งใจทำให้ตนเองเป็นคนที่น่าสนใจและน่าเป็นมิตร.";

                }else if (ans==3)
                {
                    cout << "คุณเลือกที่จะบอกชอบเขาใช่ไหม"<<endl;
                    cout << "แต่ก่อนอื่นการที่เราจะช่วยคุณนั้นเราต้องรู้ก่อนว่าคุณนั้นมีความสัมพันธ์แบบไหนกับคนที่คุณชอบ"<<endl;
                    cout << "[1]เป็นคนรู้จักกัน [2]ไม่ใช่คนรู้จักกัน"<<endl;
                    cout << "คุณเลือก:" ;
                    cin>>ans;
                    if (ans==1)
                    {
                        cout << "คุณกับคนที่คุุณชอบสนิทกันงั้นเหรอ"<<endl;
                        cout << "เขาเป็นเพื่อน รุ่นพี่ หรือรุ่นน้องคุณละ"<<endl;
                        cout << "[1]เพื่อน [2]รุ่นพี่ [3]รุ่นน้อง"<<endl;
                        cout << "คุณเลือก : ";
                        cin >> ans;
                        if (ans==1)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?"<<endl;
                            cout << "[1]น้อย [2]กลาง [3]มาก"<<endl;
                            cout << "คุณเลือก : ";
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                           
                        }else if (ans==2)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?"<<endl;
                            cout << "[1]น้อย [2]กลาง [3]มาก"<<endl;
                            cout << "คุณเลือก : ";
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                        }else if (ans==3)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?"<<endl;
                            cout << "[1]น้อย [2]กลาง [3]มาก"<<endl;
                            cout << "คุณเลือก : "<<endl;
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                        }else
                        {
                            cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                        }
                        
                        
                        
                        
                    }else if (ans==2)
                    {
                        cout << "คุณกับคนที่คุณชอบไม่ใช่คนที่สนิทกันใช่ไหม"<<endl;
                        cout << "คุณจะเลือกที่จะบอกชอบเขาเลยเหรอหรืออยากจะสนิทกับเขาก่อน"<<endl;
                        cout << "[1]บอกชอบเลย [2]อยากสนิทกับเขาก่อน"<<endl;
                        cout << "คุณเลือก:" ;
                        cin >> ans;
                        if (ans==1)
                        {
                            cout << "การบอกให้คนที่คุณไม่สนิทรู้ว่าคุณชอบเขาอาจเป็นเรื่องที่ท้าทายบ้าง แต่มีวิธีที่สามารถทำได้อย่างสุภาพและเป็นสิริมงคล นี่คือวิธีหนึ่งที่คุณสามารถลองใช้";
                            cout << "เลือกสถานการณ์ที่เหมาะสม: พยายามที่จะบอกให้เขารู้ว่าคุณชอบเขาในสถานการณ์ที่เหมาะสมและไม่เป็นที่น่าอึดอัด เช่น หากคุณกำลังอยู่ในสภาพแวดล้อมที่เงียบสงบและมีความสุข เช่น ในช่วงเวลาพักผ่อนหรือตอนหลังจากกิจกรรมที่เรียบร้อย การแสดงความรู้สึกที่ดีในช่วงเวลาเช่นนี้จะทำให้ความสัมพันธ์ของคุณดีขึ้น.";
                            cout << "ใช้ภาษาที่สุภาพและชัดเจน: เลือกใช้คำพูดที่สุภาพและตรงไปตรงมา เพื่อให้เข้าใจได้ง่ายและไม่เป็นที่เข้าใจผิด เช่น \"ฉันต้องบอกว่าฉันชอบความคิดและวิธีที่คุณแสดงออกมา\" หรือ \"ฉันชอบความคิดที่เขียนโปรแกรมของคุณและวิธีที่คุณทำงานอย่างเป็นระบบ\"";
                            cout << "อธิบายเหตุผลและสาเหตุ: บอกให้เขารู้ว่าเหตุใดที่คุณชอบเขา อธิบายถึงสิ่งที่คุณสังเกตเห็นและทำให้คุณรู้สึกดีต่อเขา เช่น \"ฉันชอบการความสนใจที่คุณแสดงให้กับผู้อื่นและการช่วยเหลือคนอื่น\" หรือ \"ฉันชอบวิธีที่คุณมีความคิดสร้างสรรค์ในการแก้ปัญหา\"";
                            cout << "เปิดโอกาสให้เขา: เมื่อคุณบอกให้เขารู้ว่าคุณชอบเขา ก็เป็นโอกาสที่ดีที่จะสร้างความสัมพันธ์ที่ดีกับเขา จะเป็นการเชิญชวนให้เขาได้ทำต่อไปและสร้างความสัมพันธ์ที่แข็งแกร่งขึ้นไปด้วย";
                            cout << "อย่าลืมว่าการพูดคุยเป็นเรื่องสำคัญ และการเป็นซื่อสัตย์และเปิดเผยความรู้สึกอาจช่วยให้คุณและคนที่คุณชอบมีความเข้าใจและความสัมพันธ์ที่ดีขึ้น";

                        }else if (ans==2)
                        {
                            /* code */
                        }else
                        {
                        cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                        }
                        
                        
                        
                    }else{
                       cout<<"";
                       cin>>ans;
                    }
    
                }else{

                 cout<<"อ";
                }
                
            }else if (ans==2)
            {
                cout<<"..";
                cout<<"ikk";
            }else{
                cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
            }
            
            
        }else if(ans == 2){
            cout << "คุณมีแฟนแล้วงั้นเหรอแล้วอยากให้คำปรึกษาอะไรคุณดีละ"<<endl;
            cout << "คุณอยากให้เราช่วยเพิ่มความหวานในชีวิตคู่ของคุณงั้นเหรอ"<<endl;
            cout << "หรือว่าช่วงนี้ชีวิตคู่ของคุณมันไม่ค่อยราบรื่นนักมีเหตุการทะเลาะกันอยู่บ่อยครั้ง"<<endl;
            cout << "หรือจะให้เราช่วยให้คำปรึกษาเกี่ยวกับวิธีขอคืนดีกับแฟนคุณดีละ"<<endl;
            cout << "เอาละเลือกซะสิว่าคุณอยากให้เราช่วยอะไร"<<endl;
            cout << "[1]อยากเพิ่มโมเม้นให้คู่รักของคุณ [2]พวกคุณกำลังทะเลาะกันอยู่ [3]กำลังจะเลิกกัน"<<endl;
            cout << "คุณเลือก:" ;
            cin >> ans;
            cout << "" << endl;
            if (ans==1)
            {
                cout<<"คุณอยากเพิ่มโมเม้นให้กับคู่รักกของคุณใช่ไหม"<<endl;
                cout<<"คุณมีแผนที่จะไปเที่ยวกันไปดูหนังหรือคุณแค่อยากใช้เวลาว่างด้วยกันละ"<<endl;
                cout<<"[1]ไปเที่ยว [2]ไปดูหนัง [3]ใช้เวลาว่างด้วยกัน"<<endl;
                cout<<"คุณเลือก";
                cin>>ans;
                if (ans==1)
                {
                    cout<<"สำหรับสถานที่ๆที่พวกเราจะแนะนำต่อไปนี้เหมาะสำหรับการไปเดทกับแฟนชิว ๆ มีดังนี้";
                    cout<<" [1] สวนพฤกษศาสตร์เชียงใหม่ "<<endl;
                    cout<<" [2] อ่างแก้ว มหาวิทยาลัยเชียงใหม่ "<<endl;
                    cout<<" [3] บ้านข้างวัด "<<endl;
                    cout<<" [4] ขุนช่างเคี่ยน "<<endl;
                    cout<<" [5] หมู่บ้านแม่กำปอง "<<endl;
                    cout<<" [6] ดอยหลวงเชียงดาว "<<endl;
                    cout<<" [7] สถาบันวิจัยดาราศาสตร์แห่งชาติ เชียงใหม่"<<endl;
                    cout<<"คุณ:";
                    cin>>ans;
                    if (ans==1)
                    {
                        cout<<" สำหรับ\"สวนพฤกษศาสตร์เชียงใหม่\"  หรือสวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์ สวนพฤษศาสตร์ที่มีต้นไม้และดอกไม้นานพันธุ์ให้เพื่อน ๆ ได้เก็บภาพสวย ๆ สำหรับแลนด์มาร์กชิค ๆ "<<endl;
                        cout<<"ที่หลายคนต้องมาแชะรูป หลายคนคงพอจะเคยเห็นมาบ้าง นั่นก็คือโดมต้นแคคตัส และทางเดินลอยฟ้าท่ามกลางป่าเขานั่นเอง และนอกจาก 2 แลนด์มาร์กนี้ที่สวนแห่งนี้ยังมีมุมชิค ๆ "<<endl;
                        cout<<"ให้เก็บรูปอีกเพียบ คู่รักที่อยากเดินเที่ยวชมธรรมชาติเพลิน ๆ ลองตามมาเช็กอินที่นี่กันได้ค่า"<<endl;
                        cout<<"เวลาเปิด-ปิด: 08:30 - 17:00 น."<<endl;
                        cout<<"ค่าเข้าชม: ผู้ใหญ่ 40 บาท นักเรียน/นักศึกษา 20 บาท"<<endl;
                        cout<<"ที่อยู่: 100 หมู่ 9 ตำบลแม่แรม อำเภอแม่ริม เชียงใหม่ 50180"<<endl;
                    }else if (ans==2)
                    {
                        cout<<"สำหรับสถานที่เดตชิลล์ ๆ ชมธรรมชาติ อย่าง \" อ่างแก้ว มหาวิทยาลัยเชียงใหม่ \" อ่างเก็บน้ำที่ล้อมรอบไปด้วยวิวทิวเขา ดูแล้วสบายตาสบายใจ ตรงข้ามลงไปอีกฝั่งถนน "<<endl;
                        cout<<"จะเป็นลานสังคีต ลานสนามหญ้ากว้าง ๆ ที่หลายคนชอบมานั่งเล่นปิกนิก บางวันจะมีเล่นดนตรี จัดคอนเสิร์ตให้ฟังกันด้วย เป็นแลนด์มาร์กเหมาะนั่งเล่นจีบกันเพลิน ๆ "<<endl;
                        cout<<"เติมความหวานให้โมเมนต์อินเลิฟ และน่าจะเหมาะกับคู่รักนักเรียนนักศึกษา เพราะอยู่ในตัวเมืองเดินทางไม่ลำบากเท่าไรด้วยค่า"<<endl;
                        cout<<"เวลาเปิด-ปิด: เปิดและปิดตามเวลาของมหาวิทยาลัย"<<endl;
                        cout<<"ค่าเข้าชม: ฟรี"<<endl;
                        cout<<"ที่อยู่: ซอยสุโขทัย 5 ตำบลสุเทพ อำเภอเมืองเชียงใหม่ เชียงใหม่ 50200"<<endl;
                    }
                    else if (ans==3) 
                    {
                        cout<<"\" บ้านข้างวัด \" แหล่งท่องเที่ยวที่ไม่ไกลจากอ่างแก้ว มหาวิทยาลัยเชียงใหม่เท่าไร อยู่ในซอยวัดอุโมงค์หลังมหาวิทยาลัยนี่เอง"<<endl;
                        cout<<"เป็นแหล่งท่องเที่ยวที่ทั้งคนเชียงใหม่และนักท่องเที่ยวแวะเวียนมาเช็กอินไม่ขาดเหมือนกัน ภายในบ้านข้างวัดจะแบ่งเป็นโซน ๆ มีทั้งโซนนั่งชิลล์"<<endl;
                        cout<<"โซนร้านอาหาร โซนร้านขายของ ตกแต่งในฟีลบ้าน ๆ เมืองเหนือ มุมถ่ายรูปชิค ๆ มีให้แชะเพียบ"<<endl;
                        cout<<"สำหรับคู่รักที่ชอบงานคาร์ฟ ไอเทมฮิป ๆ ลองตามมาเช็กอินที่นี่ไม่ผิดหวังแน่นอน"<<endl; 
                        cout<<"เวลาเปิด-ปิด: ปิดทุกวันจันทร์ เวลา 10:00 - 18:00 น."<<endl;
                        cout<<"ค่าเข้าชม: ฟรี ( อาจจะมีค่าเข้าในช่วงเทศกาล )"<<endl;
                        cout<<"ที่อยู่: บ้านข้างวัด 191 ถนนบ้านร่ำเปิง ต.สุเทพ อ.เมืองเชียงใหม่ จ.เชียงใหม่"<<endl;
                    }else if (ans==4)
                    {
                        cout<<"\" ขุนช่างเคี่ยน \" หรือสถานีวิจัยและศูนย์ฝึกอบรมเกษตรที่สูงขุนช่างเคี่ยน เป็นแหล่งท่องเที่ยวที่เหมาะมาเดตสุด ๆ เพราะในช่วงต้นปี"<<endl;
                        cout<<"ดอกพญาเสือโคร่งสีชมพูสดใสจะบานสะพรั่งไปทั่วทั้งสองข้างทาง เดินเล่นท่ามกลางอากาศเย็น ๆ ในช่วงต้นปี"<<endl;
                        cout<<"พร้อมกับชมธรรมชาติและดอกไม้สีชมพู น่าจะโรแมนติกเพิ่มความหวานให้เหล่าคู่รักได้ดีสุด ๆ ไปเลย"<<endl;
                        cout<<"เวลาเปิด-ปิด: เส้นทางขุนช่างเคี่ยนเปิดตลอด"<<endl;
                        cout<<"ค่าเข้าชม: ฟรี"<<endl;
                        cout<<"ที่อยู่: ใช้เส้นทางสายเชียงใหม่ -พระธาตุดอยสุเทพ ผ่านวัดพระธาตุดอยสุเทพ และห่างจากพระตำหนักภูพิงค์ราชนิเวศน์ประมาณ 8 กิโลเมตร"<<endl;
                    }else if (ans==5)
                    {
                        cout<<"\" หมู่บ้านแม่กำปอง \" หมู่บ้านบนเนินเขาที่มีความชิคเป็นเอกลักษณ์เฉพาะตัว เป็นที่อีกหนึ่งแหล่งท่องเที่ยวที่ทั้งคนเชียงใหม่"<<endl;
                        cout<<" และนักท่องเที่ยวชอบแวะเวียนมาเช็กอิน ด้วยความที่เป็นหมู่บ้านเล็ก ๆ อยู่บนเนินเขา เราจะได้เห็นวิวธรรมชาติยอดดอยสบายตาสบายใจไปอีกแบบ"<<endl;
                        cout<<" ยิ่งได้มาเช็กอินในช่วงต้นปีอากาศหนาว ๆ ยิ่งเพิ่มความโรแมนติกเข้าไปอีกแน่นอน"<<endl;
                        cout<<" เวลาเปิด-ปิด: เปิดตลอด"<<endl;
                        cout<<"ค่าเข้าชม: ฟรี"<<endl;
                        cout<<"ที่อยู่: หมู่บ้านแม่กำปอง อ.แม่ออน จ.เชียงใหม่"<<endl;

                    }else if (ans==6)
                    {
                        cout<<"\" ดอยหลวงเชียงดาว \" หรืออำเภอเชียงดาว ในจังหวัดเชียงใหม่ อีกหนึ่งหมู่บ้านที่นักท่องเที่ยวมักจะแวะเวียนมาเช็กอิน"<<endl;
                        cout<<"ตั้งแคมป์หรือมาพักโฮมสเตย์ชมธรรมชาติวิวยอดดอยสบายตา และนอกจากยอดดอยสวย ๆ น่ามองแล้ว"<<endl;
                        cout<<"เชียงดาวยังขึ้นชื่อเรื่องจุดชมดาวและทางช้างเผือกสวย ๆ อีกด้วย เหล่าคู่รักที่อยากนั่งนับดาวด้วยกันหวาน ๆ แพ็กกระเป๋า go to เชียงดาวเลยค่า"<<endl;
                        cout<<"เวลาเปิด-ปิด: เปิดตลอด"<<endl;
                        cout<<"ค่าเข้าชม: ฟรี"<<endl;
                        cout<<"ที่อยู่: ต.เชียงดาว อ.เชียงดาว จ.เชียงใหม่"<<endl;
                    }else if (ans==7)
                    {
                        cout<<"NARIT สถาบันวิจัยดาราศาสตร์แห่งชาติ เชียงใหม่กันก่อนได้ เพราะที่นี่เขามีทั้งนิทรรศการดาราศาสตร์ให้เข้าชมและศึกษาเพลิน ๆ"<<endl;
                        cout<<"และที่นี่ยังมีท้องฟ้าจำลองให้คู่รักมาเดต นอนดูดาวเพลิน ๆ ด้วยเหมือนกัน ส่วนคู่รักที่อยากลองส่องกล้องดูดาวมุ้งมิ้งด้วยกันสองคน"<<endl;
                        cout<<"ในวันเสาร์ช่วงเดือนพฤศจิกายน-พฤษภาคมก็มีกิจกรรมดูดาวฟรี ๆ ไม่มีค่าใช้จ่ายด้วยค่า"<<endl;
                        cout<<"นิทรรศการดาราศาสตร์ วันอังคาร - วันศุกร์ เวลา 09:00 - 16:00 น. วันเสาร์ - วันอาทิตย์ เวลา 10:00 - 17:00 น. หยุดวันจันทร์ ( เข้าชมฟรี )"<<endl;
                        cout<<"ท้องฟ้าจำลอง วันอังคาร - วันศุกร์ รอบฉาย 11:00 น. และ 15:00 น."<<endl; 
                        cout<<"วันเสาร์ รอบฉาย 11:00 น. / 14:00 น. / 17:00 น. "<<endl;
                        cout<<"วันอาทิตย์ รอบฉาย 11:00 น. "<<endl;
                        cout<<"และ 14:00 น. หยุดวันจันทร์ ค่าเข้าชมท้องฟ้าจำลอง - นักเรียน นักศึกษา 30 บาท / บุคคลทั่วไป 50 บาท"<<endl;
                        cout<<"กิจกรรมดูดาว NARIT Public Night ทุกวันเสาร์ 18:00 - 22:00 น. เข้าชมฟรี";
                    }else{
                    
                   
                    cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                    
                    }
                
                
                }else if(ans==2)
                {
                        cout<<"คุณอยากจะดูหนังกับแฟนใช่ไหม"<<endl;
                        cout<<"[1]หนังต่างประเทศ [2]หนังไทย"<<endl;
                        cout<<"คุณเลือก : ";
                        cin>>ans;
                        if(ans==1){
                        cout<<"ถ้าอย่างนั้นเราขอแนะนำ"<<endl;
                        int z=random(10);
                        if (z==1)
                        {
cout<<"                            When Harry Met Sally (1989)"<<endl<<endl;
 
cout<<"หนังรักในดวงใจของใครหลายคน ที่สร้างขึ้นจากคำถามง่ายๆ แต่ไม่เคยหาคำตอบที่ตายตัวได้ นั่นคือ \"ผู้หญิง และผู้ชาย เป็นเพื่อนกันจริงๆ ได้"<<endl;
cout<<"ไหม?\" โดยเล่าผ่านตัวละคร \"แฮร์รี่\" และ \"แซลลี่\" สองหนุ่มสาวที่เรียนเพิ่งจบมหาวิทยาลัย และต้องนั่งรถไปนิวยอร์กด้วยกันอย่างไม่เต็มใจ"<<endl;
cout<<"นัก ระหว่างทางทั้งคู่ได้แลกเปลี่ยนมุมมองความรัก ที่มีความแตกต่างกันอย่างสิ้นเชิง แต่เมื่อใช้เวลาอยู่ด้วยกันก็เริ่มมีความสนิทสนมจน"<<endl;
cout<<"กลายเป็นมิตรภาพ พร้อมๆ กับความไม่แน่ใจว่า หากจะเปลี่ยนมิตรภาพเป็นความรักโรแมนติก พวกเขาจะต้องสูญเสียอะไรบ้าง"<<endl;

                        }else if (z==2)
                        {
cout<<"                            Chungking Express (1994)"<<endl<<endl;
 
cout<<"ถือเป็นผลงานระดับมาสเตอร์พีซ ของผู้กำกับฮ่องกง \"หว่อง กาไว\" โดยเฉพาะมู้ดแอนด์โทน และสไตล์การเล่าเรื่อง อันเป็นนิยามของการ "<<endl;
cout<<"\"กระทำความหว่อง\" ที่คอหนังสายทางเลือกในไทยรู้จักกันดี หนังตั้งคำถามต่อประเด็นที่ว่า ความรักจะมีวันหมดอายุหรือไม่ พร้อมเล่าผ่านตัว"<<endl;
cout<<"ละครตำรวจหนุ่ม 2 คน ที่ต่างเฝ้ารอคอยใครบางคนเหมือนกัน หนังเรื่องนี้นำแสดงโดย เหลียงเฉาเหว่ย และเฟย์ หว่อง กลายเป็นหนังเรื่อง"<<endl;
cout<<"แรกที่สร้างชื่อเสียงระดับโลกให้ผู้กำกับอย่าง หว่อง กาไว ผู้ให้กำเนิดนิยามแห่งความหว่อง สะท้อนผ่านหนังเหงาๆ ที่ตัวละคนต่างไขว่คว้าหา"<<endl;
cout<<"ความสัมพันธ์ที่มั่นคง"<<endl;

                        }else if (z==3)
                        {
cout<<"                            Before Sunrise (1995)"<<endl<<endl;
 
cout<<"Before Sunrise เป็นต้นกำเนิดของหนังไตรภาค Before เล่าเรื่องราวของ \"เจสซี่\" หนุ่มอเมริกัน และ \"เซลีน\" สาวฝรั่งเศส ที่"<<endl;
cout<<"บังเอิญมารู้จักกันบนรถไฟระหว่างมุ่งหน้าสู่กรุงเวียนนาของออสเตรีย ถือเป็นหนังรักโรแมนติกขึ้นหิ้งอีกเรื่องหนึ่งที่แฟนหนังไม่ควรพลาด ซึ่ง"<<endl;
cout<<"ตัวละครในเรื่องนี้ก็ได้แรงบันดาลใจมาจากหญิงสาวแปลกหน้า ที่ผู้กำกับอย่าง Richard Linklater บังเอิญเจอจริงๆ"<<endl;
cout<<"หนังภาคต่อของเรื่องนี้ คือ Before Sunset (2004) และ Before Midnight (2013) ซึ่งเป็นเรื่องราวภาคต่อที่ใช้"<<endl;
cout<<"นักแสดงหลักคนเดิม และแต่ละเรื่องถ่ายทำห่างกัน 9 ปีจริงๆ"<<endl;

                        }else if (z==4)
                        {
cout<<"                            Notting Hill (1999)"<<endl<<endl;
 
cout<<"หนังรักสุดคลาสสิก ที่เหมาะสำหรับดูในวันวาเลนไทน์ เรื่องราวความรักโรแมนติกคอมเมดี้ ที่เคยสร้างความประทับใจให้ผู้คนทั่วโลก"<<endl;
cout<<"มาแล้ว หนังเล่าเรื่องราวของ \"แอนนา สก็อตต์\" นักแสดงฮอลลีวูดชื่อดัง (รับบทโดย จูเลีย โรเบิร์ตส์) ที่ดันไปตกหลุมรัก \"วิลเลียม\" (รับบท"<<endl;
cout<<"โดย ฮิวจ์ แกรนต์) ชายหนุ่มธรรมดาๆ เจ้าของร้านหนังสือ ในย่านน็อตติ้งฮิลล์ ของกรุงลอนดอน เชื่อว่าหลายคนที่ได้ดูเรื่องนี้ต้องจดจำประโยค"<<endl;
cout<<"บอกรักสุดซึ้งได้อย่างแน่นอน ความสำเร็จของหนัง Notting Hill ทำให้มีแฟนหนังทั่วโลก เดินทางมาตามหาร้านหนังสือเพื่อตามรอย"<<endl;
cout<<"หนังดังในดวงใจ"<<endl;

                        }else if (z==5)
                        {
cout<<"                            How to Lose a Guy in 10 Days (2003)"<<endl<<endl;
 
cout<<"สำหรับใครที่กำลังมองหาหนังรักสนุกๆ คลายเครียด แต่ก็ให้ข้อคิดความรักดีๆ ต้องหาเรื่องนี้มาดู เมื่อเมื่อคอลัมนิสต์สาว \"แอนดี้\" กำลังเขียน"<<endl;
cout<<"บทความเรื่อง วิธีทำให้ผู้ชายชิ่งหนีคุณภายใน 10 วัน เธอจึงต้องลงสนามเพื่อให้ได้คอนเทนต์ที่สมจริงที่สุด ในขณะที่ \"เบ็น\" พนักงานบริษัท"<<endl;
cout<<"หนุ่ม ที่ท้าพนันกับเพื่อนๆ ว่าจะต้องทำให้ผู้หญิงสักคน มาหลงรักเขาให้ได้ ภายใน 10 วัน ทั้งคู่โคจรมาเจอกัน โดยต่างหวังผลลัพธ์ที่แตกต่าง"<<endl;
cout<<"กัน จนนำไปสู่เรื่องราวป่วนๆ ชวนหัวเราะ แถมยังเป็นหนังที่สะท้อนความแตกต่างด้านมุมมองของผู้หญิง และผู้ชาย ออกมาได้น่ารักมากๆ "<<endl;

                        }else if (z==6)
                        {
cout<<"                            50 First Date (2004)"<<endl<<endl;
 
cout<<"หนังเรื่องนี้ มีชื่อไทยน่ารักๆ ว่า \"จีบเธอไม่เคยจำ\" เป็นหนังรักคอมเมดี้ แต่กลับเต็มไปด้วยเสน่ห์ ที่ทำให้คอหนังทั่วโลกแห่ไปตามรอยหนังที่"<<endl;
cout<<"เกาะฮาวาย ประเทศสหรัฐอเมริกา 50 First Date เล่าเรื่องราวของ\"เฮนรี่\" สัตวแพทย์หนุ่ม ผู้เชี่ยวชาญด้านสัตว์น้ำ ที่บังเอิญเจอ \"ลูซี่\" "<<endl;
cout<<"ครูสอนศิลปะสาวบนเกาะฮาวาย แน่นอนว่าเขาตกหลุมรักเธอทันที แต่พอรุ่งเช้าอีกวัน ก็กลับพบว่าลูซี่ ไม่สามารถจดจำเขาได้ จึงได้รู้ว่าเธอมี"<<endl;
cout<<"ปัญหาด้านความทรงจำ ซึ่งเท่ากับว่าเขาต้องเริ่มทำความรู้จักเธอใหม่ในทุกๆ วัน และเฮนรี่ยังต้องหาวิธีที่จะทำให้ผู้หญิงคนนี้ รักเขากลับในทุกๆ"<<endl;
cout<<"วันอีกด้วย"<<endl;

                        }else if (z==7)
                        {
cout<<"                            Made of Honor (2008)"<<endl<<endl;
 
cout<<"ถือเป็นหนังรัก ที่เหมาะสำหรับแอบรักเพื่อน หรือติดอยู่ในรูปแบบความสัมพันธ์ที่เรียกว่า \"เฟรนด์โซน\" ถ่ายทอดเรื่องราวผ่านตัวละคร \"ทอม\" "<<endl;
cout<<"ผู้ชายเจ้าชู้ที่ไม่ยอมลงเอยกับใครสักที เขามี \"ฮันนาห์\" เป็นเพื่อนผู้หญิงที่สนิทที่สุด ซึ่งจริงๆ แล้ว ทอมแอบหลงรักฮันนาห์มานาน แต่ไม่เคย"<<endl;
cout<<"สารภาพความในใจให้เธอรู้ จนกระทั่งวันหนึ่งฮันนาห์กำลังจะแต่งงาน และมีขอร้องให้ทอม ช่วยเป็นเพื่อนเจ้าสาว งานนี้ทอมต้องฝืนยิ้มแสดง"<<endl;
cout<<"ความยินดี ขณะเดียวกัน เขาก็หาวิธีที่จะทำให้งานแต่งงานครั้งนี้ยุติลง หนังเรื่องนี้น่าจะมอบข้อคิดดีๆ ให้หลายๆ คนที่รู้จักหัวใจของตัวเองช้า"<<endl;
cout<<"เกินไป"<<endl;

                        }else if (z==8)
                        {
cout<<"                            500 Days of Summer (2009)"<<endl<<endl;
 
cout<<"หนังรักที่ครองใจหนุ่มสาวทั่วโลก หลายคนยกให้เรื่องนี้ เป็นหนังรักอกหัก และจะสอนให้รับมือกับความสัมพันธ์ที่ผิดหวัง เพื่อมูฟออนต่อไป "<<endl;
cout<<"หนังเล่าเรื่องราวของ \"ทอม\" พนักงานออฟฟิศหนุ่ม ที่ทำหน้าที่เขียนคำอวยพรบนการ์ดให้ลูกค้า เขาตกหลุมรัก \"ซัมเมอร์\" สาวสวยประจำ"<<endl;
cout<<"ออฟฟิศ ทอมเชื่อว่านี่คือพรหมลิขิต ขณะที่ซัมเมอร์ เป็นผู้หญิงที่เชื่อในเรื่องการแต่งงาน และไม่ต้องการความผูกมัดกับใคร หนังเรื่องนี้คือ ตัว"<<endl;
cout<<"จุดกระแสให้เพลง \"There Is a Light That Never Goes Out\" ของวง The Smiths โด่งดังอย่างมาก รวมถึง"<<endl;
cout<<"มักจะมีแฟนๆ แบ่งฝั่งออกเป็น ทีมทอม และทีมซัมเมอร์ ตามประสบการณ์ความรักส่วนตัวของตนเอง ซึ่งหลังดูหนังจบ หลายๆ คนมักจะบอก"<<endl;
cout<<"ว่า \"ทุกคน ต่างเคยมีซัมเมอร์ เป็นของตัวเอง\""<<endl;

                        }else if (z==9)
                        {
cout<<"                            Midnight in Paris (2011)"<<endl<<endl;
 
cout<<"หนังรักโรแมนติก ของผู้กำกับ วูดดี้ อัลเลน ที่หยิบยกเรื่องราวความรัก ความแฟนตาซี และความงดงามของวรรณกรรม มาผสมไว้ด้วยกัน หนัง"<<endl;
cout<<"เล่าเรื่องราวของ \"กิล\" นักเขียนหนุ่ม ที่เดินทางไปเที่ยวกรุงปารีสกับคู่หมั้น ในยามค่ำคืนเขาออกมาเดินเล่น และขึ้นรถยนต์ปริศนา ที่พาเขาย้อน"<<endl;
cout<<"เวลากลับไปยัง ปี 1920 ซึ่งได้ชื่อว่าเป็นยุคทองของปารีส เขาได้พบนักเขียน และศิลปินระดับโลกที่เคยมีชีวิตอยู่ในอดีต รู้ตัวอีกทีเขาก็ตก"<<endl;
cout<<"หลุมรักอดีตเสียแล้ว แล้วจะจัดการกับปัจจุบันอย่างไร นี่คือหนังที่สะท้อนว่า มนุษย์ล้วนนิยมความหอมหวานของอดีต แต่กลับประเมินปัจจุบัน"<<endl;
cout<<"ว่าเป็นช่วงเวลาที่ไร้ค่า และน่าทรมาน"<<endl;

                        }else{
cout<<"                            About Time (2013)"<<endl<<endl;
 
cout<<"เชื่อว่า About Time คือหนังรักในดวงใจของใครหลายคน มีทั้งฉากรักโรแมนติก และฉากซึ้งเรียกน้ำตา พร้อมทั้งมอบข้อคิดดีๆ เรื่อง"<<endl;
cout<<"ความรัก ที่จะทำให้ทุกคนอยากทำปัจจุบันให้ดีที่สุด โดยเล่าเรื่องของ \"ทิม\" ชายหนุ่มที่พบว่า เขามีความสามารถในการเดินทางข้ามเวลา เขา"<<endl;
cout<<"เลือกใช้มันในการย้อนเวลากลับไปหาแฟน ด้วยการจีบผู้หญิงที่เขาชอบ นำไปสู่หลายๆ เหตุการณ์ที่เขาเลือกจะใช้พลังพิเศษนี้ ในการกำหนด"<<endl;
cout<<"สถานการณ์ แต่ทุกอย่างก็ไม่ได้ราบรื่นอย่างที่เขาคิด นี่คือหนังรักที่จะมอบความลับในการใช้ชีวิตอย่างมีความสุขให้คุณ"<<endl;

                            
                        }
                        }else if (ans==2)
                        {
                            cout<<"ถ้าอย่างนั้นเราขอแนะนำ"<<endl;
                        int t=random(10);
                        if (t==1){
cout<<"                            รถไฟฟ้ามาหานะเธอ (2009)"<<endl<<endl;
cout<<"เป็นหนึ่งในภาพยนตร์โรแมนติกคอมเมดี้ของ GTH ที่ได้รับรายได้สูงสุดและเป็นภาพยนตร์ไทยที่ทำเงินมาก"<<endl;
cout<<"ที่สุดในปีที่ฉาย ในเรื่องราวนี้ เราพบกับ \"เหมยลี่\" สาวโสดที่มีอายุ 30 ปีที่กำลังมองหาความรักแท้ แม้ว่าเธอจะพยายามหาความรัก แต่ก็รู้สึกท้อแท้"<<endl;
cout<<"เพราะเธอยังไม่ได้มีคู่รักและไม่ได้แต่งงานเหมือนเพื่อน ๆ ของเธอ ชีวิตของเธอเป็นไปตามปกติเหมือนสาวออฟฟิศทั่วไปที่ใช้รถไฟฟ้าในการเดินทาง"<<endl;
cout<<"ทุกวัน"<<endl;
cout<<"หนึ่งวัน เมื่อเธอกำลังขึ้นรถไฟฟ้า เธอได้พบกับ \"ลุง\" ชายวิศวกรรถไฟฟ้าที่ทำงานในระบบรถไฟฟ้าเดียวกัน ความรักก็เกิดขึ้นทันที แต่กลับพบกับทาง"<<endl;
cout<<"ที่ยากลำบาก เนื่องจากตารางทำงานของทั้งคู่ต่างกัน แม้จะมีความยากลำบาก แต่เหมยลี่เห็นลุงเป็นผู้ชายที่สมบูรณ์แบบและพยายามทำทุกวิถีทาง"<<endl;
cout<<"เพื่อให้ความรักของพวกเขา"<<endl;

                        }else if (ans==2)
                        {
cout<<"                            สิ่งเล็ก ๆ ที่เรียกว่ารัก (2010)"<<endl<<endl;
cout<<"สิ่งเล็ก ๆ ที่เรียกว่ารัก ได้กลายเป็นปรากฎการณ์หนังรักไทยที่โด่งดังมากที่สุดเรื่องหนึ่งตั้งแต่ออกฉาย และได้กลายเป็นหนึ่งในหนังความรักไทยสุดคลาสสิก ที่มี"<<endl;
cout<<"โครงสร้างด้วยองค์ประกอบที่สำคัญทั้งหมดของเรื่องราวที่มีเสน่ห์ โดยมีฉากหลังเป็นโรงเรียนมัธยมและความรักในวัยรุ่นที่สดใส เป็นหนังที่ถูกนำไปรีเมคเป็นซีรีส์"<<endl;
cout<<"จีนเรื่อง A Little Thing Called First Love ในปี 2019 ภาพยนตร์เรื่องนี้ถ่ายทอดความรักครั้งแรกผ่านสายตาของ “น้ำ” เด็กสาววัยเรียนที่ตกหลุม"<<endl;
cout<<"รักรุ่นพี่สุดหล่อที่ดังที่สุดในโรงเรียนอย่าง “โชน” น้ำพยายามทำทุกอย่างเพื่อให้เขาสนใจโดยไม่รับความช่วยเหลือจากเพื่อน ๆ ทั้งการเปลี่ยนแปลงตัวเองให้ดูดีขึ้น"<<endl;
cout<<"กว่าเดิม และการทำวิธีต่าง ๆ เพื่อเอาชนะใจเขา เรื่องราวในหนังไทยโรแมนติกเรื่องนี้เป็นความรักที่เรียบง่ายแต่แสนหวาน ที่จะทำให้ผู้ชมได้ย้อนนึกถึงเรื่องราว"<<endl;
cout<<"ของตัวเองเมื่อสมัยวัยเด็กแบบน้ำและโชน"<<endl;

                        }else if (ans==3)
                        {
cout<<"                            กวนมึนโฮ (2010)"<<endl<<endl;
cout<<"ถ้าคุณกำลังมองหาหนังโรแมนติกไทย ที่ทั้งซึ้ง ทั้งฮา ต้องเรื่องนี้เลย กวนมึนโฮ หนังรักซึ้ง ๆ ไทยที่คุณจะฮาจนน้ำตาไหล หนัง บอกเล่าเรื่องราวของคนสองคนที่ไม่"<<endl;
cout<<"รู้จักกันมาก่อน ที่กำลังจะเดินทางไปยังประเทศเกาหลีใต้และบังเอิญพบกันตั้งแต่สนามบิน เธอหนีจากแฟนเจ้ากี้เจ้าการของเธอเพื่อเติมเต็มจินตนาการในซีรีส์"<<endl;
cout<<"เกาหลีของเธอ ส่วนเขาโดนแฟนสาวหักอกมาและต้องการมาพักใจในดินแดนแห่งนี้ โดยไม่รู้เลยว่าที่นี่จะทำให้เขาได้พบกับเธอผู้ที่จะมาเปลี่ยนชีวิตของเขาไป"<<endl;
cout<<"ตลอดกาล ทั้งคู่โคจรมาพบกันและเจอกับเรื่องราวอันยุ่งเหยิงที่เต็มไปด้วยเสียงหัวเราะเคล้าน้ำตา จนในที่สุดทั้งสองก็ตกหลุมรักกันทั้ง ๆ ที่ไม่รู้จักชื่อกันและกัน"<<endl;
cout<<"เลย แม้ว่าเรื่องราวจะชวนฮาขนาดไหน แต่ตอนจบจะทำให้คุณน้ำตาไหลได้อย่างแน่นอน"<<endl;

                        }else if (ans==4)
                        {
cout<<"                            Friend Zone ระวัง..สิ้นสุดทางเพื่อน (2019)"<<endl<<endl;
cout<<"หากเคยประทับใจกับใบเฟิร์น พิมพ์ชนก ในสิ่งเล็ก ๆ ที่เรียกว่ารักกันมาแล้ว นี่คืออีกผลงานของเธอที่คนจะต้องจดจำ กับเรื่องราวของเฟรนด์โซน หนังไทยโรแมน"<<endl;
cout<<"ติกตลกที่โดนใจคนดู เพราะตรงกับชีวิตของใครหลายคน เมื่อชายคนหนึ่งตกหลุมรักเพื่อนสาวคนสนิทของตนเองมาร่วมสิบปี แต่กลับติดอยู่ในสถานะ “เพื่อนที่ดี"<<endl;
cout<<"ที่สุด” ความสัมพันธ์ของทั้งคู่เป็นเรื่องราวที่ชวนตลกขบขัน และต้องไปพบเจอเรื่องชวนหัวด้วยกันเสมอมา จากความสนิทก็กลายเป็นความรัก แต่ถ้ารักข้างเดียว"<<endl;
cout<<"แล้วต้องอยู่ในฐานะเพื่อนตลอดไปและถูกจัดให้อยู่ใน “เฟรนด์โซน” แบบนี้จะทำยังไง นี่คือเรื่องราวที่มีสถานการณ์ตรงกับคนอีกมากมายที่ดูแล้วนอกจากจะได้นึก"<<endl;
cout<<"ย้อนไปถึงตัวเอง ยังทำให้คุณรู้สึกสนุกและมีความสุขเมื่อนึกถึงอีกด้วย"<<endl;

                        }else if (ans==5)
                        {
cout<<"                            แสงกระสือ (2019)"<<endl<<endl;
cout<<"ทันทีที่เห็นชื่อเรื่อง อย่าเพิ่งคิดว่านี่คือหนังผีหรือหนังสยองขวัญของไทยทั่วไป เพราะแท้จริงแล้วมันคือหนังรักไทยเรื่องหนึ่งที่ถูกสร้างมาอย่างสวยงาม มีนักแสดงที่"<<endl;
cout<<"ดี โครงเรื่องที่น่าสนใจ สเปเชียลเอฟเฟกต์ที่สวยงาม และจบลงอย่างคาดไม่ถึง เป็นหนังไทยโรแมนติกดี ๆ อีกเรื่องที่เราอยากแนะนำให้คุณได้ดู ภาพยนตร์เรื่องนี้"<<endl;
cout<<"แสดงถึงพลังแห่งความรัก เกี่ยวกับสาวต้องคำสาปให้กลายเป็นกระสือ ผีพื้นบ้านของไทยตามความเชื่อ และแฟนหนุ่มผู้กล้าหาญที่พยายามช่วยชีวิตเธอให้หลุด"<<endl;
cout<<"พ้นจากบ่วงนี้ ท่ามกลางการตามล่าของกลุ่มล่ากระสือและคนในหมู่บ้าน ที่เขาและเธอต้องเผชิญกับอุปสรรคและความทุกข์ยากมากมาย ก่อนที่บทสรุปสุดท้าย"<<endl;
cout<<"จะทำให้คุณได้เห็นถึงความรักระหว่างคนและผี ที่ใครก็มองว่าเธอคือตัวประหลาด"<<endl;

                        }else if (ans==6)
                        {
cout<<"                            รักแห่งสยาม (2007)"<<endl<<endl;
cout<<"นี่คือหนังโรแมนติกไทย LGBTQ เรื่องแรกของไทยที่กล่าวถึงความรักในวัยเรียน หนึ่งในภาพยนตร์ไทยที่โด่งดังและเป็นที่จดจำที่สุด รักแห่งสยาม เต็มไปด้วย"<<endl;
cout<<"เรื่องราวความรักและความสัมพันธ์ เริ่มจากมิตรภาพที่ใกล้ชิดของสองหนุ่ม “ต๋อง” และ “มิว” แม้ว่าพวกเขาจะแยกทางกันเมื่อโตขึ้น แต่ทั้งสองก็พบกันอีกครั้ง"<<endl;
cout<<"ท่ามกลางอาชีพนักดนตรีที่ประสบความสำเร็จของมิว หลังจากสับสนและเผชิญปัญหาในชีวิตมาหลายปี เมื่อได้กลับมาพบกันอีกครั้งพวกเขาก็กลับมาด้วย"<<endl;
cout<<"ความรู้สึกที่ซับซ้อน และความสัมพันธ์รวมถึงเคมีระหว่างกันก็ไม่อาจปฏิเสธได้"<<endl;

                        }else if (ans==7)
                        {
cout<<"                            ฮาวทูทิ้ง..ทิ้งอย่างไรไม่ให้เหลือเธอ (2019)"<<endl<<endl;
cout<<"หนังรักไทยที่นำเสนอเรื่องราวที่ต่างจากที่เราเคยเห็น เมื่อเรื่องราวเล่าถึงหญิงสาวที่ชื่อ “จีน” ที่กลับมาจากเรียนต่อต่างประเทศในฐานะสถาปนิก และตัดสินใจว่า"<<endl;
cout<<"บ้านของเธอจะต้องรกร้างว่างเปล่า เธอต้องการรีโนเวทบ้านใหม่โดยตั้งใจทิ้งทุกอย่างที่ไม่ใช้แล้ว หรือของที่เก็บไว้แล้วไม่มีประโยชน์ จนกระทั่งเธอเจอสิ่งของของ"<<endl;
cout<<"แฟนเก่าและเริ่มหวนคิดถึง และนั่นทำให้เธอเริ่มรู้สึกได้ว่าการทิ้งของนั้นไม่ใช่เรื่องง่าย เพราะทุกอย่างมันมีเรื่องราวให้ชวนคิดถึงและจดจำ มีอดีตที่ยังค้างคา เธอ"<<endl;
cout<<"จึงตั้งคำถามกับตัวเองว่า จะทิ้งลงถุงดำไป จะเก็บไว้ หรือจะเอาไปคืนเจ้าของ ถึงจะเป็นการทิ้งที่สมบูรณ์อย่างที่เธอตั้งใจ ใครที่อยู่ในสถานะถูกทิ้ง ถูกลืม จะต้อง"<<endl;
cout<<"อินกับหนังความรักไทยเรื่องนี้อย่างแน่นอน"<<endl;

                        }else if (ans==8)
                        {
cout<<"                            ดิว ไปด้วยกันนะ (2019)"<<endl<<endl;
cout<<"อีกหนึ่งหนังไทยรักซึ้ง ๆ ที่พูดถึงความรักแบบ LGBTQ และการนำเสนอความรักที่แตกต่างของวัย กับบาดแผลในอดีตที่เชื่อมโยงมาถึงปัจจุบัน เล่าถึงความรัก"<<endl;
cout<<"ที่ย้อนวัยไปในยุค 90s เมื่อ “ดิว” เด็กใหม่ที่เพิ่งย้ายโรงเรียนมาได้พบกับเพื่อนใหม่อย่าง “ภพ” และก่อเกิดความสัมพันธ์ที่เกินเพื่อน แต่ด้วยยุคสมัยนั้นที่เรื่องของ"<<endl;
cout<<"เพศที่สามยังไม่เป็นที่ยอมรับนัก ทำให้ทั้งคู่ต้องแยกจากกันไป จนกระทั่ง 23 ปีต่อมา ภพได้กลับมาเป็นครูที่โรงเรียนมัธยมเก่าของเขาสมัยยังเรียนอยู่กับดิว เขาได้"<<endl;
cout<<"พบกับนักเรียนสาวคนหนึ่ง เธอเหมือนใครคนหนึ่งที่เขาคุ้นเคยอย่างมาก ยิ่งได้ใกล้ชิดเพราะต้องคอยดูแล เขาก็เริ่มรู้สึกว่าเธออาจมีความเชื่อมโยงอย่างลึกลับกับ"<<endl;
cout<<"ความสัมพันธ์ต้องห้ามที่เขามีเมื่อตอนเป็นวัยรุ่น"<<endl;

                        }else if (ans==9)
                        {
cout<<"                            สุขสันต์วันโสด (2020)"<<endl<<endl;
cout<<"นี่คือหนังรักที่แฝงไปด้วยความตลก เป็นหนังโรแมนติกไทยที่เหมาะกับการดูเพื่อผ่อนคลายความเครียด จะสุข เศร้า เหงา และฮาแค่ไหน เมื่อคนโสดและคนอกหัก"<<endl;
cout<<"ต้องมาอยู่ร่วมกัน ณ โฮมสเตย์บนเขาที่ห่างไกลเมือง ต่างคนต่างที่มาแต่มีจุดประสงค์เดียวกันคือมาพักใจ เรื่องราวเริ่มขึ้นจาก “นุ่น” หญิงสาวผู้มีพลังพิเศษที่ทำ"<<endl;
cout<<"ให้มองเห็นผี แต่มันกลับทำลายชีวิตรักของเธอ เมื่อใจพังก็ต้องหาที่พักใจ เธอจึงลุยเดี่ยวกับทริปรักษาแผลใจ ที่ว่าเริ่มที่ไหนจบที่นั่น นั่นจึงเป็นเหตุผลที่เธอมาที่กิ่ว"<<endl;
cout<<"แม่ปาน และที่โฮมสเตย์แห่งนี้เธอก็ได้พบกับชาวโสดขี้เหงาอีกหลายคน และหนึ่งในนั้นก็คือ “พุธ” นักเขียนบทไอเดียตัน ที่ทั้งรักและงานพังไม่เป็นท่า จนต้อง"<<endl;
cout<<"ออกมาหาแรงบันดาลใจในการทำหนังผีเรื่องใหม่ของเขา และก็ได้ “คนเห็นผี” อย่างเธอมาช่วยไว้พอดี"<<endl;

                        }else {
cout<<"                            Seasons Change เพราะอากาศเปลี่ยนแปลงบ่อย (2006)"<<endl<<endl;
cout<<"ปิดท้ายด้วยหนังรักซึ้ง ๆ ไทย ที่จะทำให้คุณหัวใจสั่นไหว กับความรักที่ทำให้คุณชุ่มชื่นฉ่ำใจในฤดูฝน เรื่องราวความรักของวัยมัธยมที่หัวใจยังคงเปลี่ยนแปลงได้"<<endl;
cout<<"ตามฤดูกาล เกี่ยวกับความสัมพันธ์ของเด็กวัยรุ่น 3 คน ที่เรียนที่วิทยาลัยดุริยางคศิลป์ มหาวิทยาลัยมหิดล “ป้อม” ตัดสินใจสมัครเข้าเรียนมัธยมปลายที่นี่ ใน"<<endl;
cout<<"สาขาเตรียมดนตรี เพราะต้องการอยู่ใกล้ชิดกับ “ดาว” เด็กสาวจากโรงเรียนเดียวกันที่เขาแอบรัก ในขณะเดียวกันป้อมก็ได้เจอกับ “อ้อม” ที่เป็นลูกสาวของเพื่อน"<<endl;
cout<<"พ่อ อ้อมได้สอบเข้าที่วิทยาลัยเดียวกันกับเขา เมื่อป้อมได้อยู่ใกล้ชิดดาวความรักก็เริ่มก่อตัวขึ้นไปพร้อม ๆ กับฤดูกาลที่เปลี่ยนไป จึงเกิดเรื่องราวที่น่าประทับใจ"<<endl;
cout<<"พร้อมกับการเปลี่ยนแปลงไปมาอยู่เสมอของวัยว้าวุ่น ไม่ว่าจะเรื่องดนตรี การเรียน ความรัก และชีวิตในอนาคต เหมือนกับอากาศที่เปลี่ยนแปลงบ่อย และใจ"<<endl;
cout<<"คนเราก็เช่นกัน"<<endl;

                        }
                        
                        
                        }

                
                }else if (ans==3)
                {
                    cout<<"คุณอยากจะใช้เวลาว่างด้วยกันกับแฟนของคุณใช่ไหม"<<endl;
                    cout<<"งั้นคุณลอง"<<endl;
                    int a=random(7);
                    if (a==1)
                    {
                        cout<<"อ่านหนังสือเล่มโปรดของแฟน"<<endl;
                        cout<<"ถ้าเราอยากรู้จักใครให้ลึกยิ่งขึ้น เราควรอ่านในสิ่งที่เขาชอบอ่าน หรือฟังเพลงที่เขาชอบฟัง เป็นการเรียนรู้ชีวิตของอีกฝ่ายว่าเขามีไลฟสไตล์ประมาณไหน มันอาจจะไม่ตรงกับเราไปซะทุกอย่าง "<<endl;
                        cout<<"แต่เชื่อเถอะค่ะว่าการเรียนรู้โลกของคนพิเศษ มันจะทำให้เราเปิดใจกว้างขึ้นอีกหลายเท่าเลยนะ! นอกจากเราจะมีไลฟสไตล์เป็นของตัวเองแล้ว เรายังแชร์สิ่งที่ชอบกับเราที่เรารักได้ด้วย "<<endl;
                        cout<<"แถมยังเป็นอะไรที่ดูใส่ใจไปอี๊กกก แบบนี้แฟนรักตายเลยน้า"<<endl;
                    }else if (a==2)
                    {
                        cout<<"ดินเนอร์ใต้แสงจันทร์ สร้างความโรแมนติกบ้าง"<<endl;
                        cout<<"กิจกรรมทำกับแฟนที่หลายคู่ทำบ๊อยบ่อย ในขณะที่บางคู่ไม่เคยทำเลย ก็คือการออกไปดินเนอร์ในมู้ดโรแมนติกนั่นเองค่า รู้ไหมว่าการสร้างบรรยากาศแนว"<<endl;
                        cout<<"โรแมนซ์นิด ๆ ช่วยให้หัวใจพองโตขึ้นเป็นกองเลยนะจะบอกให้! หาวันหยุดที่ตรงกัน ลองชวนแฟนออกไปกินมื้อค่ำที่ร้านอาหารเล็ก ๆ แสงไฟสลัว ๆ แล้ว"<<endl;
                        cout<<"จิบไวน์ไปมองตากันไป รับรองว่าสวีทจนแฟนไม่หนีไปไหนแน่นอน!"<<endl;


                    }else if (a==3)
                    {
                        cout<<"ทำอาหารเล็กๆน้อยๆด้วยกัน"<<endl;
                        cout<<"ลองสร้างบรรยากาศน่ารัก ๆ แบบง่าย ๆ ด้วยการชวนกันทำอาหารกินกันเองในบ้าง ก็คือคิ้วท์มากแกร! เหมือนฉากในละครไปอีกกก ไม่ว่าปกติเราจะไม่ค่อย"<<endl;
                        cout<<"เข้าครัวก็ตาม แต่ถ้าได้ลองมาช่วยกันทำ เธอผัด ฉันปรุง เมนูง่าย ๆ แล้วผลัดกันชิม แค่นี้ก็อบอุ่นหัวใจมาก ๆ แล้วค่ะทุกคน ปกติใครชอบปล่อยให้แฟนเข้า"<<endl;
                        cout<<"ครัวคนเดียว งานนี้ลองอาสาเข้าไปช่วยทำ รับรองว่าแฟนปลื้มมม ความรักหวานชื่นจนมดขึ้นจานไปเลยจ้า"<<endl;


                    }else if (a==4)
                    {
                        cout<<"ดูหนังฟังเพลงอยู่ที่บ้าน"<<endl;
                        cout<<"ดูหนังอยู่บ้าน เป็นอีกหนึ่ง กิจกรรมทำกับแฟน ที่หลายคนมักมองข้ามไป เพราะส่วนใหญ่ก็อาจจะไปดูในโรงภาพยนตร์ หรือไม่ก็ต่างคนต่างแยกกันดู คนละ"<<endl;
                        cout<<"มุมบ้าน เอาใหม่ค่ะ รอบนี้เปลี่ยนเป็นชวนกันมานั่งดูหนังสักเรื่อง ที่ทั้งคู่อาจจะยังไม่เคยดู หาขนมมานั่งกินกรุบกริบ อาจจะสร้างบรรยากาศไฟส้ม ๆ สวย ๆ "<<endl;
                        cout<<"สักหน่อย นอกจากจะสนุกไปกับหนังแล้ว ยังได้ความเป็นส่วนตัวด้วย แค่นึกก็ฟินแล้วใช่ม้าา"<<endl;

                    }else if (a==5)
                    {
                        cout<<"หาของใช้ หรือไอเท็มใหม่ๆคู่กันดูบ้าง"<<endl;
                        cout<<"หยุดนี้ลองไปเดินช้อปปิ้งด้วยกันก็ไม่เลวน้า ช้อปปิ้งสามารถเป็น กิจกรรมทำกับแฟน ได้ หากของที่เราเลือกซื้อเป็นของที่สามารถใช้ด้วยกัน หรือช่วยกัน"<<endl;
                        cout<<"เลือกได้ อาจจะเป็นไอเท็ม Unisex ที่ใช้ได้ทั้งชายหญิง เช่น เลือกแปรงสีฟัน  / ผ้าปูที่นอน / ชุดนอน / เสื้อผ้าที่เป็นคู่ / ของแต่งห้อง กระจุ๊กกระจิ๊ก"<<endl;
                        cout<<"ทั้งหลาย ให้เราและแฟนได้มีส่วนร่วมในการตัดสินใจ และสนุกไปด้วยกัน ไม่ใช่พาแฟนไปช้อปของที่สนองตัวเองนะจ๊ะ อันนี้เดี๋ยวแฟนจะหงอยเอาได้นะซิส"<<endl;


                    }else if (a==6)
                    {
                        cout<<"เล่นเกม OFFLINE ด้วยกัน"<<endl;
                        cout<<"Pause เกมออนไลน์เอาไว้ก่อน แล้วลองชวนแฟนมาเล่นเกมแบบง่าย ๆ ไม่ต้องมีเน็ตก็เล่นได้ดูบ้างดีกว่า ยกตัวอย่างเช่น เกมบอย / เกมแฟมิลี(รู้เลยว่าไม่เด็กแล้ว) / "<<endl;
                        cout<<"หรือบอร์ดเกมต่าง ๆ เพราะนอกจากจะเป็นการตัดเราออกจากโซเชียล และโลกภายนอกแล้ว เรายังได้โฟกัสกับแฟนมาก ๆ ได้สนุกด้วยกัน หัวเราะด้วยกัน "<<endl;
                        cout<<"โดยไม่ต้องนึกถึงสิ่งอื่น บอกเลยว่า กิจกรรมทำกับแฟน ไอเดียนี้เวิร์คมาก รับรองว่าสนิทกับแฟนมากขึ้นแน่นอนค่า"<<endl;


                    }else{
                        cout<<"หาเวลามองตา นั่งคุยกันอย่างตั้งใจดูสักครั้ง"<<endl;
                        cout<<"คู่ไหนไม่ค่อยมีเวลาว่างตรงกัน ต้องลองชวนกันไปนั่งจิบกาแฟ จิบชา ตามร้านเล็ก ๆ สักแห่ง แล้วคุยสัพเพเหระกันบ้างนะคะ บรรยากาศร้านเล็ก ๆ จะช่วย"<<endl;
                        cout<<"ให้เรารู้สึกอบอุ่นและมีความสุข ยิ่งคนตรงข้ามเป็นคนพิเศษแล้ว ยิ่งทำให้การสนทนาสนุกยิ่งขึ้น อาจจะนั่งคุยกันถึงเรื่องอนาคต หรือความทรงจำเก่า ๆ หรือ"<<endl;
                        cout<<"อาจจะคุยเรื่องรอบตัว เกี่ยวกับคนรอบข้างได้หมด สิ่งสำคัญคือเราได้นั่งมองหน้าแฟนอย่างตั้งใจ และได้อัพเดทความคิดของเขาไปด้วย เป็นอีกหนึ่งกิจกรรม"<<endl;
                        cout<<"ทำกับแฟน ที่ไม่ควรพลาดเลยนะคะ"<<endl;
                        }
                    cout<<endl;
                    cout<<"สิ่งที่อยากเตือนคุณ ให้ใส่ใจและหมั่นทำให้ได้บ่อย ๆ ก็คือ การแสดงความรักต่อกันนั่นเองค่า โดยการจะบอกรักคนพิเศษของเรามันมี"<<endl;
                    cout<<"หลากหลายวิธี อาจจะไม่จำเป็นต้องบอกรัก ในกรณีที่บางคู่รู้สึกเขินที่จะต้องพูด หรือบางคู่รู้สึกว่า ไม่จำเป็นต้องพูดบ่อย แต่เราก็สามารถแสดงความรักได้" <<endl;
                    cout<<"เช่น การถามไถ่ สนใจเขาในทุก ๆ  วัน พูดดี ๆ ทำสิ่งดี ๆ ให้เขา มอบของขวัญเล็ก ๆ น้อย ๆ ให้เขาบ้าง อาจจะกอด หรือจับมือกันให้บ่อยขึ้น แต่สำหรับคู่"<<endl;
                    cout<<"ไหนที่บอกรักกันเป็นปกติ แนะนำให้บอกรักกันทุกวันนะคะ เพราะมันเป็นเหมือนยาใจ ที่ช่วยเติมความหวานให้ไม่มีวันหมดเลยจริงจริ๊ง"<<endl;
         
                }else{
                    cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                }
                
                
                

            }else if (ans==2)
            {
                cout<<"คุณทะเลาะกับแฟนคุณอยู่เหรอ"<<endl;
                cout<<"คุณอยากคืนดีกันไหม"<<endl;
                cout<<"[1]ใช่ [2]ไม่ใช่"<<endl;
                cout<<"คุณเลือก:";
                cin>>ans;
                if (ans==1)
                {
                    
cout<<"ประเมินสถานการณ์"<<endl;
cout<<""<<endl;
cout<<"Step 1: ใจเย็นๆ"<<endl;
cout<<"ใจเย็นๆ หลังจากการทะเลาะ ควรทำการห่างกันเป็นเวลา 2-3 ชั่วโมงหรือถึง 2-3 วัน เพื่อให้ความเครียดลดลงและทั้งคู่สามารถรีเล็กซ์ได้ ทำกิจกรรมที่ผ่อนคลายเช่นเดินเล่นหรือดูหนัง"<<endl;
cout<<"เพื่อให้สามารถประเมินสถานการณ์ได้อย่างสง่างาม"<<endl;
cout<<"Step 2: วิเคราะห์หาต้นเหตุ"<<endl;
cout<<"การวิเคราะห์ต้นเหตุของการทะเลาะช่วยในการแก้ไขปัญหา ทำการทบทวนเหตุการณ์ที่เกิดขึ้นเพื่อค้นหาปัจจัยที่เป็นตัวกระตุ้น และสามารถหาทางแก้ไขให้สอดคล้องกับปัญหา"<<endl;
cout<<"Step 3: เปิดใจคุยกัน"<<endl;
cout<<"หลังจากที่ใจได้รับการผ่อนคลาย การเปิดใจคุยเป็นขั้นตอนสำคัญ เราควรยอมรับความรู้สึกและอารมณ์ของตนเอง และตั้งใจฟังความคิดเห็นของอีกฝ่าย "<<endl;
cout<<"การแสดงความเข้าใจและอาละวาดให้ทราบถึงความจำเป็นของปัญหาที่เกิดขึ้น"<<endl;
cout<<"                    "<<endl;
cout<<""<<endl;
                cout<<"[1]ต่อไป "<<endl;
                cin>> ans;
                if (ans==1)
                    {
cout<<"ปรับความเข้าใจ"<<endl;
cout<<""<<endl;
cout<<"Step 1: การปรับความเข้าใจ"<<endl;
cout<<"ให้เริ่มต้นการพูดคุยด้วยความสง่างามและอารมณ์เย็น หากมีความขัดแย้ง ควรหาเวลาเพื่อปรับความเข้าใจระหว่างกัน ควรเลือกเวลาที่สะดวกและไม่มีความกดดัน ถ้าการทะเลาะกันมีขนาดใหญ่ "<<endl;
cout<<"ควรเลือกเวลาที่เหมาะสมและทำให้ทั้งสองฝ่ายรู้สึกสบายใจ"<<endl;
cout<<"Step 2: การใช้ภาษากายเพื่อแสดงความเปิดใจ"<<endl;
cout<<"ใช้ภาษากายที่แสดงถึงความเปิดใจ การสบตาและพยักหน้าเพื่อแสดงระยะห่างและความสนใจ อย่าทำท่าทางที่ดูเครียดหรือเคร่งครึม ทำให้เนื้อหาของคุยมีความสุขภาพมากขึ้น"<<endl;
cout<<"Step 3: การสื่อสารที่ชัดเจน"<<endl;
cout<<"การสื่อสารควรเป็นไปในทางที่ชัดเจนและน่าฟัง เมื่อพูดคุยควรให้ความเข้าใจเกี่ยวกับความรู้สึกและความคิดของตนเองอย่างชัดเจน การใช้คำว่า \"ผมรู้สึก...\" หรือ \"ผมคิดว่า...\" "<<endl;
cout<<"จะช่วยให้ความคิดเข้าใจได้ดีขึ้น"<<endl;
cout<<"Step 4: การเข้าใจตรงกัน"<<endl;
cout<<"เข้าใจว่ามีจุดที่เห็นไม่ตรงกัน เป็นธรรมชาติที่คนสองคนจะมีความต่าง การเข้าใจและปรับตัวเองเพื่อให้สอดคล้องกับคู่ควรถือเป็นหลักการที่สำคัญ"<<endl;
cout<<"Step 5: การเอ่ยคำขอโทษ"<<endl;
cout<<"หากมีการกระทำหรือพูดอะไรที่ทำให้เกิดความขัดแย้ง ควรเป็นกำลังใจที่จะเอ่ยคำขอโทษ การเอ่ยคำขอโทษแสดงถึงความตั้งใจที่จะรับผิดชอบและพร้อมที่จะปรับปรุงตน"<<endl;
cout<<"Step 6: การตรวจสอบจุดที่เห็นไม่ตรงกัน"<<endl;
cout<<"การตรวจสอบจุดที่เห็นไม่ตรงกันและพยายามหาวิธีในการปรับปรุงและปรับตัวเอง เพื่อให้สามารถควบคุมสถานการณ์และพัฒนาความสัมพันธ์ได้ดียิ่งขึ้น"<<endl;
cout<<""<<endl;
                cout<<"[1]ต่อไป "<<endl;
                cin>> ans;
                if (ans==1)
                    {            
cout<<"ป้องกันไม่ให้ทะเลาะกันอีกในเร็ววัน"<<endl;
cout<<""<<endl;
cout<<"Step 1: การจบคำพูดตรงที่ ตอนที่มีปัญหา"<<endl;
cout<<"ควรพูดคุยในทันทีที่ปัญหาเกิดขึ้นและไม่ควรปล่อยให้มีความขัดแย้งเพิ่มเติม การแก้ไขปัญหาในตอนที่เริ่มต้นจะช่วยป้องกันไม่ให้เกิดปัญหาที่มีขนาดใหญ่ขึ้น"<<endl;
cout<<"Step 2: การแก้ปัญหาอย่างเป็นจริง"<<endl;
cout<<"ไม่ควรให้ความรู้สึกสะท้อนในการพูดคุย แต่ควรหาทางแก้ปัญหาอย่างเป็นจริง เพื่อป้องกันไม่ให้เรื่องทะเลาะกันกลายเป็นปัญหาที่ใหญ่ขึ้น"<<endl;
cout<<"Step 3: การมองทะลุถึงความน้อยใจ"<<endl;
cout<<"การสังเกตความน้อยใจและความไม่พอใจจะช่วยในการแก้ไขปัญหา การเข้าใจและพยายามแก้ไขความน้อยใจจะช่วยสร้างความเข้าใจกันมากขึ้น"<<endl;
cout<<"Step 4: การทะเลาะแบบจับใจความ"<<endl;
cout<<"หลีกเลี่ยงการทะเลาะกันอย่างคิดถึงเรื่องในอดีต และให้ความสำคัญในการปรับตัวเองเพื่อลดความขัดแย้ง การทำแบบนี้ช่วยในการป้องกันปัญหาทะเลาะที่อาจกลายเป็นเรื่องใหญ่ขึ้น"<<endl;
                    }else
                    {
                        cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                    }
                    
                    }else
                    {
                        cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                    }
                    
                    
                }else if (ans==2)
                {
                    cout<<"คุณไม่ได้อยากคืนดีกันเหรอ"<<endl;
                    cout<<"งั้นก็แล้วแต่คุณ"<<endl;
                    cout<<"แต่ถ้าหากตอนนี้คุณยังไม่ทำอะไรเลยคุณอาจจะไม่มีโอกาสได้คืนดีกันแล้วนะ";
                }else{
                    cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                }
                
                
            }else if (ans==3)
            {
                cout<<"คุณกำลังจะเลิกกันเหรอ"<<endl;
                cout<<"คุณอยากจะยื้อความพันธ์นี้ไหมหรืออยากจะมูฟออนจากมัน"<<endl;
                cout<<"[1]อยากจะยื้อความพันธ์ [2]อยากจะมูฟออน"<<endl;
                cout<<"คุณเลือก :"<<endl;
                cin>>ans;
                if (ans==1)
                {
                    cout<<"วิธีง้อแฟนยังไงให้หายโกรธ"<<endl;
                    cout<<"1. ขอโทษอย่างจริงใจ"<<endl;
                    cout<<"-ขอโทษให้เร็วที่สุด"<<endl;
                    cout<<"-ยอมรับว่าตัวเองผิด"<<endl;
                    cout<<"-ไม่พูดขอโทษบ่อยๆ"<<endl;
                    cout<<"-ขอโทษก่อนไม่ได้แปลว่าแพ้"<<endl;
                    cout<<"-อย่าพูดคำขอโทษที่ไม่รู้สึกผิด"<<endl;
                    cout<<"2. ซื้อของที่แฟนชอบ"<<endl;
                    cout<<"3. พาไปทานของอร่อย"<<endl;
                    cout<<"4. สกินชิพช่วยได้"<<endl;
                    cout<<"5. ซื้อของที่แฟนชอบ"<<endl;
                    cout<<"6. รอเวลาให้แฟนใจเย็น"<<endl;
                    cout<<"7. อย่าทะเลาะกันข้ามวัน"<<endl;
                    cout<<"8. ปรับปรุงตัวเองให้ดีขึ้น"<<endl;
                    cout<<"9. ลองทำสิ่งใหม่ๆ ด้วยกัน"<<endl;
                }else if (ans==2)
                {
                    cout<<"วิธี Move on จากความสัมพันธ์เป็นพิษ "<<endl;
                    cout<<"ตั้งเป้าหมายในชีวิต "<<endl;
                    cout<<"อยู่กับปัจจุบัน "<<endl;
                    cout<<"เชื่อในตัวเอง "<<endl;
                    cout<<"ค้นหาจุดเด่นของเราเอง "<<endl;
                    cout<<"กล้าเผชิญหน้ากับปัญหา "<<endl;
                    cout<<"หมั่นให้กำลังใจตนเอง "<<endl;
                    cout<<"ใช้เหตุผลมากกว่าอารมณ์ "<<endl;
                    cout<<"ยอมรับข้อผิดพลาดของตัวเอง "<<endl;
                }else
                {
                    cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
                }
                
                
                
            }else{

                cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";

            }
            
            
            
        }else{
            cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
        }
        
    }else if (ans==2)
    {
        cout<<"อืมมมคุณไม่มีเรื่องที่จะถามเราเกี่ยวกับความรักใช่ไหมงั้นลองดูเรื่องอื่นไหม";

    }else{
        cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
    }
    }
    