#include <iostream>


using namespace std;



    void love(){
    int ans;
    cout << "คุณอยากจะปรึกษาเราเกี่ยวกับเรื่องความรักใช่หรือไม่" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณเลือก:" ;
    cin >> ans;
    if(ans == 1){
        cout << "ก่อนอื่นเราจะอยากขอทราบสถานะของคุณก่อนว่าคุณโสดหรือมีแฟนแล้ว ?" << endl;
        cout << "[1]โสด [2]มีแฟนแล้ว" << endl;
        cout << "คุณเลือก:" ;
        cin >> ans;
        if(ans == 1){
            cout << "หากว่าคุณยังโสดอยู่แล้วคุณมีคนในใจอยู่แล้วหรือยัง" << endl;
            cout << "[1]มีคนที่ชอบแล้ว [2]ยังไม่มีคนที่ชอบ" << endl;
            cout << "คุณเลือก:" ;
            cin >>ans;
            if(ans==1)
            {
                cout << "คุณมีคนที่ชอบแล้วใช่ไหมเอาละคุณอยากจจะให้เราอะไรดี"<<endl;
                cout << "คุณอยากให้เราช่วยในทำให้เขาสนใจในตัวคุณเหรอ อยากเข้าหาเขา"<<endl;
                cout << "หรือความสัมพันธ์ของคุณกับคนที่คุณชอบอยู่ในระดับที่คุถณสามมารถขอเขาเป็นแฟนแล้วแต่คุณยังรู้ว่าต้องทำอย่างไง"<<endl;
                cout << "คุณอยากให้เราช่วยเรื่องอะไรดีละ"<<endl;
                cout << "[1]อยากเขาสนใจในตัวคุณ [2]อยากจะเข้าหาเขา [3]อยากบอกชอบ"<<endl;
                cout << "คุณเลือก:" ;
                cin >> ans;
                if (ans==1)
                {
                    cout << "การที่คุณอยากให้เขาสนใจในตัวคุณนั้น"<<endl;
                    cout << "เราก็อยากจะขอถามคุณว่าคุณพร้อมที่จะพัฒนาตัวเองไหม"<<endl;
                    cout << "[1]พร้อม [2]ไม่พร้อม"<<endl;
                    cout << "คุณเลือก :  "<<endl;
                    cin >> ans;
                    if (ans==1)
                    {
                        /* code */
                    }else if (ans==2)
                    {
                        /* code */
                    }else{
                        
                    }
                    
                    

                }else if (ans==2)
                {
                    cout << "การที่คุณจะเข้าหาคนที่คุณชอบนั้นมีวิธีที่หลากหลาย ต่อไปนี้คือบางวิธีที่อาจช่วยให้คุณเข้าหาคนที่คุณชอบได้:"<<endl;
                    cout << "พูดคุยอย่างเปิดเผย: เลือกเปิดตัวตนของคุณให้คนที่คุณชอบรู้จัก พูดคุยเกี่ยวกับความสนใจ, ความฝัน, และประสบการณ์ของคุณ."<<endl;
                    cout << "สร้างโอกาสในการพบกัน: หากมีโอกาสในการเข้าร่วมกิจกรรมหรืองานที่คนที่คุณชอบกำลังเข้าร่วม, มีโอกาสที่คุณจะพบกันและมีโอกาสในการทำความรู้จัก."<<endl;
                    cout << "แสดงความน่ารัก: การแสดงท่าทางและพฤติกรรมที่น่ารักสามารถทำให้คนอื่นรู้สึกถึงความเป็นมิตรและใกล้ชิด";
                    cout << "พูดเพราะหรือมีทักษะในการสื่อสาร: การมีทักษะในการสื่อสารที่ดีสามารถช่วยให้คุณสามารถแสดงความคิดเห็นและความรู้สึกของคุณได้อย่างชัดเจน"<<endl;
                    cout << "สร้างความมีเสน่ห์: การมีทักษะทางสังคมและการแสดงอารมณ์ที่เชิดชูสามารถทำให้คนอื่นรู้สึกถึงความมีเสน่ห์ของคุณ"<<endl;
                    cout << "ช่วยเหลือและเป็นที่ต้องการ: การแสดงความกรุณาและเป็นที่ต้องการสามารถสร้างความประทับใจที่ดีให้กับคนอื่น ๆ"<<endl;
                    cout << "รักษาความสุขในตนเอง: การมีความสุขและมีสมาธิในตนเองสามารถทำให้คนอื่น ๆ รู้สึกดีในการอยู่ร่วมกับคุณ"<<endl;
                    cout << "ให้สัญญาณทางด้านกายภาพ: การให้สัญญาณทางด้านกายภาพอาจช่วยให้คนที่คุณชอบเข้าใจถึงความสนใจของคุณ."<<endl;
                    cout << "ใช้สื่อสังคม: ในโลกที่เชื่อมต่ออยู่กันมากขึ้น, การใช้สื่อสังคมออนไลน์สามารถช่วยในการสร้างความรู้จักและสื่อสาร."<<endl;
                    cout << "ขอความช่วยเหลือหรือคำแนะนำ: ถ้าคุณมีความสนใจในคนที่คุณต้องการเข้าหา, ลองขอความช่วยเหลือหรือคำแนะนำในเรื่องที่เขามีความรู้."<<endl;
                    cout << "เข้าใจและรับฟัง: ความเข้าใจและการรับฟังต่อความคิดเห็นและความรู้สึกของคนที่คุณชอบสามารถสร้างความสัมพันธ์ที่ดี."<<endl;
                    cout << "อย่าเร่งเร้า: ให้ความสนใจของคุณเติบโตและพัฒนาไปพร้อมๆ กับความเข้าใจที่ลึกซึ้งเกี่ยวกับคนที่คุณชอบ."<<endl;
                    cout << "จำไว้ว่าไม่สมควรทำตัวไปตรงกับคนเพื่อให้ชอบคุณ แต่ควรเป็นตัวของคุณเองและเพิ่มพูนทักษะที่ทำให้คุณมีความเป็นมิตรและน่าสนใจในสายงานของคุณเอง."<<endl;
                    cout << "และจงจำไว้ว่าการสร้างความรู้จักและความสนใจในส่วนของอีกฝ่ายมักจะเป็นเรื่องที่ต้องใช้เวลา และอาจจะไม่มีคำตอบที่แน่นอนในการทำให้คนนั้นชอบคุณ ควรมีความไว้วางใจและตั้งใจทำให้ตนเองเป็นคนที่น่าสนใจและน่าเป็นมิตร.";

                }else if (ans==3)
                {
                    cout << "คุณเลือกที่จะบอกชอบเขาใช่ไหม"<<endl;
                    cout << "แต่ก่อนอื่นการที่เราจะช่วยคุณนั้นเราต้องรู้ก่อนว่าคุณนั้นมีความสัมพันธ์แบบไหนกับคนที่คุณชอบ"<<endl;
                    cout << "[1]เป็นคนรู้จักกัน [2]ไม่ใช่คนรู้จักกัน";
                    cout << "คุณเลือก:" ;
                    cin>>ans;
                    if (ans==1)
                    {
                        cout << "คุณกับคนที่คุุณชอบสนิทกันงั้นเหรอ"<<endl;
                        cout << "เขาเป็นเพื่อน รุ่นพี่ หรือรุ่นน้องคุณละ";
                        cout << "[1]เพื่อน [2]รุ่นพี่ [3]รุ่นน้อง";
                        cout << "คุณเลือก : ";
                        cin >> ans;
                        if (ans==1)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?";
                            cout << "[1]น้อย [2]กลาง [3]มาก";
                            cout << "คุณเลือก : ";
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                           
                        }else if (ans==2)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?";
                            cout << "[1]น้อย [2]กลาง [3]มาก";
                            cout << "คุณเลือก : ";
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                        }else if (ans==3)
                        {
                            cout << "คุณคิดว่าคุณสนิทกับเขาขนาดไหน ?";
                            cout << "[1]น้อย [2]กลาง [3]มาก";
                            cout << "คุณเลือก : ";
                            cin >> ans;
                            if (ans==1)
                            {
                                /* code */
                            }else if (ans==2)
                            {
                                /* code */
                            }else if (ans==3)
                            {
                                /* code */
                            }else
                            {
                               cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                            }
                        }else
                        {
                            cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                        }
                        
                        
                        
                        
                    }else if (ans==2)
                    {
                        cout << "คุณกับคนที่คุณชอบไม่ใช่คนที่สนิทกันใช่ไหม"<<endl;
                        cout << "คุณจะเลือกที่จะบอกชอบเขาเลยเหรอหรืออยากจะสนิทกับเขาก่อน"<<endl;
                        cout << "[1]บอกชอบเลย [2]อยากสนิทกับเขาก่อน";
                        cout << "คุณเลือก:" ;
                        cin >> ans;
                        if (ans==1)
                        {
                            cout << "การบอกให้คนที่คุณไม่สนิทรู้ว่าคุณชอบเขาอาจเป็นเรื่องที่ท้าทายบ้าง แต่มีวิธีที่สามารถทำได้อย่างสุภาพและเป็นสิริมงคล นี่คือวิธีหนึ่งที่คุณสามารถลองใช้";
                            cout << "เลือกสถานการณ์ที่เหมาะสม: พยายามที่จะบอกให้เขารู้ว่าคุณชอบเขาในสถานการณ์ที่เหมาะสมและไม่เป็นที่น่าอึดอัด เช่น หากคุณกำลังอยู่ในสภาพแวดล้อมที่เงียบสงบและมีความสุข เช่น ในช่วงเวลาพักผ่อนหรือตอนหลังจากกิจกรรมที่เรียบร้อย การแสดงความรู้สึกที่ดีในช่วงเวลาเช่นนี้จะทำให้ความสัมพันธ์ของคุณดีขึ้น.";
                            cout << "ใช้ภาษาที่สุภาพและชัดเจน: เลือกใช้คำพูดที่สุภาพและตรงไปตรงมา เพื่อให้เข้าใจได้ง่ายและไม่เป็นที่เข้าใจผิด เช่น \"ฉันต้องบอกว่าฉันชอบความคิดและวิธีที่คุณแสดงออกมา\" หรือ \"ฉันชอบความคิดที่เขียนโปรแกรมของคุณและวิธีที่คุณทำงานอย่างเป็นระบบ\"";
                            cout << "อธิบายเหตุผลและสาเหตุ: บอกให้เขารู้ว่าเหตุใดที่คุณชอบเขา อธิบายถึงสิ่งที่คุณสังเกตเห็นและทำให้คุณรู้สึกดีต่อเขา เช่น \"ฉันชอบการความสนใจที่คุณแสดงให้กับผู้อื่นและการช่วยเหลือคนอื่น\" หรือ \"ฉันชอบวิธีที่คุณมีความคิดสร้างสรรค์ในการแก้ปัญหา\"";
                            cout << "เปิดโอกาสให้เขา: เมื่อคุณบอกให้เขารู้ว่าคุณชอบเขา ก็เป็นโอกาสที่ดีที่จะสร้างความสัมพันธ์ที่ดีกับเขา จะเป็นการเชิญชวนให้เขาได้ทำต่อไปและสร้างความสัมพันธ์ที่แข็งแกร่งขึ้นไปด้วย";
                            cout << "อย่าลืมว่าการพูดคุยเป็นเรื่องสำคัญ และการเป็นซื่อสัตย์และเปิดเผยความรู้สึกอาจช่วยให้คุณและคนที่คุณชอบมีความเข้าใจและความสัมพันธ์ที่ดีขึ้น";

                        }else if (ans==2)
                        {
                            /* code */
                        }else
                        {
                        cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด"; 
                        }
                        
                        
                        
                    }else{
                       cout<<"";
                       cin>>ans;
                    }
    
                }else{

                 cout<<"อ";
                }
                
            }else if (ans==2)
            {
                cout<<"..";
                cout<<"ikk";
            }else{
                cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
            }
            
            
        }else if(ans == 2){
            cout << "คุณมีแฟนแล้วงั้นเหรอแล้วอยากให้คำปรึกษาอะไรคุณดีละ"<<endl;
            cout << "คุณอยากให้เราช่วยเพิ่มความหวานในชีวิตคู่ของคุณงั้นเหรอ"<<endl;
            cout << "หรือว่าช่วงนี้ชีวิตคู่ของคุณมันไม่ค่อยราบรื่นนักมีเหตุการทะเลาะกันอยู่บ่อยครั้ง"<<endl;
            cout << "หรือจะให้เราช่วยให้คำปรึกษาเกี่ยวกับวิธีขอคืนดีกับแฟนคุณดีละ"<<endl;
            cout << "เอาละเลือกซะสิว่าคุณอยากให้เราช่วยอะไร"<<endl;
            cout << "[1]อยากเพิ่มโมเม้นให้คู่รักของคุณ [2]พวกคุณกำลังทะเลาะกันอยู่ [3]อยากคืนดีกับแฟน"<<endl;
            cout << "คุณเลือก:" ;
            cin >> ans;
            cout << "" << endl;
            if (ans==1)
            {
                /* code */
            }else if (ans==2)
            {
                /* code */
            }else if (ans==3)
            {
                /* code */
            }else{

                cout << "กรุณาเลือกคำตอบตามที่ทางเรากำหนด";

            }
            
            
            
        }else{
            cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
        }
        
    }else if (ans==2)
    {
        cout<<"อืมมมคุณไม่มีเรื่องที่จะถามเราเกี่ยวกับความรักใช่ไหมงั้นลองดูเรื่องอื่นไหม";

    }else{
        cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
    }
    }