#include <iostream>

using namespace std;

int main(){
    int ans;
    cout << "คุณกำลังมีปัญหาทางการเรียนใช่หรือไม่?" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณ: ";
    cin >> ans;
    if(ans == 1){
        cout << "คุณมีปัญหาอะไรเกี่ยวกับการเรียน?" << endl;
        cout << "[1]ขาดสมาธิในการเรียน [2]การเรียนไม่มีประสิทธิภาพ [3]ขาดความมั่นใจในตนเอง [4]ปัญหาในการจดจำ [5]ปัญหาในการทำการบ้านหรืองานที่กำหนด" << endl;
        cout << "คุณ: ";
        cin >> ans;
        if(ans == 1){
            cout << "คุณมีปัญหาเรื่องสมาธิในการเรียนใช่มั้ย ลองใช้เทคนิคการจัดการเวลาและการแบ่งงาน เริ่มต้นด้วยการกำหนดเวลาเรียนและพักผ่อนให้เหมาะสม เพื่อให้สามารถรักษาสมาธิในระหว่างการเรียนได้" << endl;
        }else if(ans == 2){
            cout << "หากการเรียนของคุณไม่มีประสิทธิภาพ ลองพิจารณาวิธีการเรียนที่แตกต่าง เช่น การใช้เทคโนโลยีในการเรียน เรียนรู้ผ่านวิดีโอออนไลน์ หรือเข้าร่วมกลุ่มการเรียนร่วมกับเพื่อน" << endl;
        }else if(ans == 3){
            cout << " หากคุณรู้สึกไม่มั่นใจในความสามารถของตนเอง ลองการฝึกฝนทักษะและความรู้เพิ่มเติม เช่น การเข้าร่วมคอร์สออนไลน์ การอ่านหนังสือที่เกี่ยวข้อง หรือการฝึกฝนทักษะด้านบุคลิกภาพ" <<endl;
        }else if(ans == 4){
            cout << "หากมีปัญหาในการจดจำข้อมูล ลองใช้เทคนิคการเรียนรู้ที่แตกต่าง เช่น การใช้การ์ดอับเระด์เพื่อฝึกการจดจำ การสร้างแผนผังความคิด หรือการใช้เทคโนโลยีช่วยในการจดจำ" << endl;
        }else if(ans == 5){
            cout << "หากมีปัญหาในการทำการบ้านหรืองานที่กำหนด ลองการแบ่งงานออกเป็นส่วนย่อย เพื่อลดความกดดันและเพิ่มประสิทธิภาพในการทำงาน" << endl;
        }
        cout << "การเรียนเป็นการลงมือทำและมุ่งมั่น เชื่อในความสามารถของตัวเอง ไม่ว่าจะมีความยากลำบากเพียงไหน ";
        if(ans != 1 || ans != 2 || ans != 3 || ans != 4 || ans != 5) cout << "โปรดเลือกเลข 1-5 เท่านั้น"; 
    }else{
        cout << "ดีแล้วละ:)";
    }
    return 0;
}