#include <iostream>

using namespace std;

string eiei = {"ด้านความจำ", "ด้านการคิดวิเคราะห์และตีความโจทย์", "ด้านความขยัน"};

    void study(){
    int ans,mmr,thk,dlg;
    cout << "คุณกำลังมีปัญหาทางการเรียนใช่หรือไม่?" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณ: ";
    cin >> ans;
    if(ans == 1){
        cout << "ตอนนี้คุณให้คะแนนแต่ละด้านของคุณเท่าไหร่" << endl;
        cout << "ด้านความจำ" << endl;
        cout << "แย่         ปานกลาง         ดีเยี่ยม" << endl ;
        cout << "[1][2][3][4][5][6][7][8][9][10]"<< endl;
        cout << "คุณ: ";
        cin >> mmr;
        cout << "ด้านการคิดวิเคราะห์และตีความโจทย์" << endl;
        cout << "แย่         ปานกลาง         ดีเยี่ยม" << endl ;
        cout << "[1][2][3][4][5][6][7][8][9][10]"<< endl;
        cout << "คุณ: ";
        cin >> thk;
        cout << "ด้านความขยัน" << endl;
        cout << "แย่         ปานกลาง         ดีเยี่ยม" << endl ;
        cout << "[1][2][3][4][5][6][7][8][9][10]"<< endl;
        cout << "คุณ: ";
        cin >> dlg;
        if(mmr < 4){
            cout << "ชั้นคิดว่าคุณต้องพัฒนาด้านความทรงจำหน่อยนะ" << endl; 
            cout << "[1]ต้องการ [2]ไม่ต้องการ" << endl;
            cin >> ans;
            if(ans = 1){
                cout << "1. คุณลองกำหนดเป้าหมายในการเรียน เช่น ในวันนี้คุณจะท้องจำคำศัพท์ให้ได้ 20 คำ และคุณต้องมีวินับกับตนเองด้วย" << endl;
                cout << "2. คุณลองใช้เทคนิคการจำแบบเป็นภ่าพมั้ย การจำด้วยภ่พเป็นการจำที่ใช้จินตนาการผสมกับความรู้สึกนึกคิด ทำให้การจำแม่นยำขึ้น" << endl;
                cout << "3. คุณต้องหมั่นทบทวนตัวเองอย่างสม่ำเสมอ เพื่มเสริมความจำและความเข้าใจ" << endl;
            }
        }if(thk < 4){
            cout << "ชั้นคิดว่าคุณต้องพัฒนาด้านการวิเคราะห์และตีโจทย์หน่อยนะ" << endl;
            cout << "[1]ต้องการ [2]ไม่ต้องการ" << endl;
            cin >> ans;
            if(ans = 1){
                cout << "1. คุณลองทำโจทย์ใหม่ๆและขยันทบทวนโจทย์ที่เคยทำมาก่อนแล้ว" << endl;
                cout << "2. เวลาทำโจทย์คุณลองกำหนดเป็นขั้นตอนมั้ย มันอาจจะทำให้คุณหาคำตอบของโจทย์ได้ง่ายขึ้น" << endl;
                cout << "3. คุณต้องหมั่นทบทวนอย่างสม่ำเสมอ ไม่มีอะไรดีเท่ากับการทำซ้ำๆแล้วละ" << endl;
            }
        }if(dlg < 4){
            cout << ""
        }



        cin >> ans;
        if(ans == 1){
            cout << "คุณมีปัญหาเรื่องสมาธิในการเรียนใช่มั้ย ลองใช้เทคนิคการจัดการเวลาและการแบ่งงาน เริ่มต้นด้วยการกำหนดเวลาเรียนและพักผ่อนให้เหมาะสม เพื่อให้สามารถรักษาสมาธิในระหว่างการเรียนได้" << endl;
        }else if(ans == 2){
            cout << "หากการเรียนของคุณไม่มีประสิทธิภาพ ลองพิจารณาวิธีการเรียนที่แตกต่าง เช่น การใช้เทคโนโลยีในการเรียน เรียนรู้ผ่านวิดีโอออนไลน์ หรือเข้าร่วมกลุ่มการเรียนร่วมกับเพื่อน" << endl;
        }else if(ans == 3){
            cout << " หากคุณรู้สึกไม่มั่นใจในความสามารถของตนเอง ลองการฝึกฝนทักษะและความรู้เพิ่มเติม เช่น การเข้าร่วมคอร์สออนไลน์ การอ่านหนังสือที่เกี่ยวข้อง หรือการฝึกฝนทักษะด้านบุคลิกภาพ" <<endl;
        }else if(ans == 4){
            cout << "หากมีปัญหาในการจดจำข้อมูล ลองใช้เทคนิคการเรียนรู้ที่แตกต่าง เช่น การใช้การ์ดอับเระด์เพื่อฝึกการจดจำ การสร้างแผนผังความคิด หรือการใช้เทคโนโลยีช่วยในการจดจำ" << endl;
        }else if(ans == 5){
            cout << "หากมีปัญหาในการทำการบ้านหรืองานที่กำหนด ลองการแบ่งงานออกเป็นส่วนย่อย เพื่อลดความกดดันและเพิ่มประสิทธิภาพในการทำงาน" << endl;
        }
        cout << "การเรียนเป็นการลงมือทำและมุ่งมั่น เชื่อในความสามารถของตัวเอง ไม่ว่าจะมีความยากลำบากเพียงไหน ";
        if(ans != 1 || ans != 2 || ans != 3 || ans != 4 || ans != 5) cout << "โปรดเลือกเลข 1-5 เท่านั้น"; 
    }else cout << "ดีแล้วละ:)";
    }