#include <iostream>

using namespace std;

    int main(){
    int ans;
    cout << "คุณอยากจะปรึกษาเราเกี่ยวกับเรื่องความรักใช่หรือไม่" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณ: ";
    cin >> ans;
    if(ans == 1){
        cout << "ก่อนอื่นเราจะอยากขอทราบสถานะของคุณก่อนว่าคุณโสดหรือมีแฟนแล้ว ?" << endl;
        cout << "[1]โสด [2]มีแฟนแล้ว" << endl;
        cout << "คุณ: ";
        cin >> ans;
        if(ans == 1){
            cout << "หากว่าคุณยังโสดอยู่แล้วคุณมีคนในใจอยู่แล้วหรือยัง" << endl;
            cout << "[1]มีคนที่ชอบแล้ว [2]ยังไม่มีคนที่ชอบ" << endl;
            cout << "คุณ:";
            cin >>ans;
            if(ans==1)
            {
                cout << ""<<endl;
                cout << ""<<endl;
                cout << ""<<endl;
                cin >> ans;
                if (ans==1)
                {
                    /* code */
                }else if (ans==2)
                {
                    /* code */
                }else if (ans==3)
                {
                    cout<<"";
                    cout<<"";
                    cin>>ans;
                    if (ans==1)
                    {
                        /* code */
                    }else if (ans==2)
                    {
                        /* code */
                    }else{
                       cout<<"";
                       cin>>ans;
                    }
    
                }else{

                 cout<<"อ";
                }
                
            }else if (ans==2)
            {
                cout<<"";
                cout<<"";
            }else{
                cout <<"";
            }
            
            
        }else if(ans == 2){
            cout<<"คุณมีแฟนแล้วงั้นเหรอแล้วอยากให้คำปรึกษาอะไรคุณดีละ"<<endl;
            cout<<"คุณอยากให้เราช่วยเพิ่มความหวานในชีวิตคู่ของคุณงั้นเหรอ"<<endl;
            cout<<"หรือว่าช่วงนี้ชีวิตคู่ของคุณมันไม่ค่อยราบรื่นนักมีเหตุการทะเลาะกันอยู่บ่อยครั้ง"<<endl;
            cout<<"หรือจะให้เราช่วยให้คำปรึกษาเกี่ยวกับวิธีขอคืนดีกับแฟนคุณดีละ"<<endl;
            cout<<"เอาละเลือกซะสิว่าคุณอยากให้เราช่วยอะไร"<<endl;
            cout<<"[1]อยากเพิ่มโมเม้นให้คู่รักของคุณ [2]พวกคุณกำลังทะเลาะกันอยู่ [3]อยากคืนดีกับแฟน"<<endl;
            cout<<"คุณเลือก:" ;
            cin>>ans;
            cout << "" << endl;
        }else{
            cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
        }
        
    }else if (ans==2)
    {
        cout<<"อืมมมคุณไม่มีเรื่องที่จะถามเราเกี่ยวกับความรักใช่ไหมงั้นลองดูเรื่องอื่นไหม";

    }else{
        cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
    }
    }