#include <iostream>

using namespace std;

    int main(){
    int ans;
    cout << "คุณอยากจะปรึกษาเราเกี่ยวกับเรื่องความรักใช่หรือไม่" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณ: ";
    cin >> ans;
    if(ans == 1){

        cout << "ก่อนอื่นเราจะอยากขอทราบสถานะของคุณก่อนว่าคุณโสดหรือมีแฟนแล้ว ?" << endl;
        cout << "[1]โสด [2]มีแฟนแล้ว" << endl;
        cout << "คุณ: ";
        cin >> ans;
        if(ans == 1){
            cout << "คุณมีปัญหาเรื่องสมาธิในการเรียนใช่มั้ย ลองใช้เทคนิคการจัดการเวลาและการแบ่งงาน เริ่มต้นด้วยการกำหนดเวลาเรียนและพักผ่อนให้เหมาะสม เพื่อให้สามารถรักษาสมาธิในระหว่างการเรียนได้" << endl;
        }else if(ans == 2){
            cout << "หากการเรียนของคุณไม่มีประสิทธิภาพ ลองพิจารณาวิธีการเรียนที่แตกต่าง เช่น การใช้เทคโนโลยีในการเรียน เรียนรู้ผ่านวิดีโอออนไลน์ หรือเข้าร่วมกลุ่มการเรียนร่วมกับเพื่อน" << endl;
        }else{
            cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
        }
        
    }else if (ans==2)
    {
        cout<<"เยี่ยม";
        
    }else{
        cout<<"กรุณาเลือกคำตอบตามที่ทางเรากำหนด";
    }
    }