#include <iostream>


using namespace std;



    int main(){
    int ans;
    cout << "คุณอยากจะปรึกษาเราเกี่ยวกับเรื่องสุขภาพใช่หรือไม่" << endl;
    cout << "[1]ใช่ [2]ไม่ใช่" << endl;
    cout << "คุณเลือก:" ;
    cin >> ans;
    if(ans == 1){
        cout << "คุณอยากปรึกษาด้านสุขภาพร่างกายหรือสุขภาพจิต" << endl;
        cout << "[1]สุขภาพร่างกาย [2]สุขภาพจิต" << endl;
        cout << "คุณเลือก:" ;
        cin >> ans;
        if(ans == 1){
            cout << "ตอนนี้สุขภาพร่างกายของคุณเป็นอย่างไรบ้าง" <<endl;
            cout << "[1]ป่วยทุกวัน [2]ป่วยบ้างเป็นบางครั้ง " <<endl;
            cin >> ans;
            if(ans ==1||ans==2){
            cout << "คุณได้ทานอาหารครบ 5 หมู่มั้ย" <<endl;
            cout << "[1]ใช่ [2]ไม่ใช่"<<endl;
            cin >> ans;
                if(ans == 1){
                cout << "ดีมาก การรับประทานอาหารให้ครบ 5 หมู่เป็นส่วนสำคัญมากในการรักษาสุขภาพของเรา" << endl;
                }
                 else if(ans==2){
                cout << "คุณควรรับประทานอาหารให้ครบ 5 หมู่นะ ไม่งั้นคุณก็ควรมองหาอาหารเสริมในส่วนของสารอาหารในขาดไปนะ เพราะ การรับประทานอาหารให้ครบ 5 หมู่เป็นส่วนสำคัญมากในการรักษาสุขภาพของเรา "<< endl;       
                 }
            cout << endl;
            cout << "คุณได้ออกกำลังกายบ้างมั้ยจ้ะ"<<endl ;
            cout << "[1]ทุกวัน [2]เกือบทุกวัน [3]1-2ครั้ง/สัปดาห์ [4] ไม่ออกกำลังกายเลย"<<endl;;
            cin >> ans;
            if(ans ==1||ans==2){
                cout << "ดีแล้วทำต่อไป การออกกำลังกายนอกจากจะช่วยให้สุขภาพแข็งแรงแล้ว ยังช่วยให้เราดูดีขึ้นด้วย"<<endl;
            }
            else if(ans==3){
                cout << "คุณต้องออกกำลังเพิ่มหน่อยแล้ว เพื่อสุขภาพของคุณจะได้ดีขึ้น สู้ๆ"<<endl;
            }
            else if(ans==4){
                cout << "คุณต้องเริ่มออกกำลังกายบ้างแล้วหละ"<<endl;
            }
            cout << "คุณอยากได้โปรแกรมออกกำลังกายง่ายๆมั้ย"<<endl;
            cout << "[1]อยากได้ [2]ไม่เอาอะ"<<endl;
            cin >> ans;
            if(ans==1){
                cout <<"ยังไม่ได้ใส่"<<endl;
            }
    //ใส่เนื้อหาการออกกำลังกายเบื้องต้นด้วยยยยยยยยยยยยยยยยยยยยยยยยยยยยย
            else if(ans==2){
                cout << "โอ๊ะเค"<<endl;
            }
            cout <<"คุณพักผ่อนเพียงพอหรือไม่"<<endl << "[1]เพียงพอ [2]ไม่เพียงพอ"<<endl;
            cin>>ans;
            if(ans==1){
                cout << endl;
            }
            else if(ans==2){
                cout<< "คุณต้องพักผ่อนบ้างนะ เพราะการนอนหลับให้เพียงพอ เป็นส่วนสำคัญที่จะทำให้ร่างกายแข็งแรง"<<endl;
            }
            cout <<"หากคุณทำตามข้างต้นทั้งหมดแต่สุขภาพยังไม่ดีขึ้น เราขอแนะนำให้คุณไปตรวจสุขภาพ หรือไปพบแพทย์ ดูแลสุขภาพด้วยนะตัวเอง เราเป็นห่วงคุณ"<<endl;

    
            }
       
        }
        else if(ans==2){
            cout << "คุณมีความเครียดระดับไหน 1-10"<<endl;
            cin >> ans;
            if (ans==1||ans==2||ans==3||ans==4||ans==5){
                cout<<"ลองหากิจกรรมที่ตัวเองชอบดูนะ มันช่วยให้เราเครียดน้อยลงได้นะ"<<endl;
            }
            else if(ans==6||ans==7||ans==8||ans==9||ans==10){
                cout<<"คุรควรระบายออกมาให้ใครซักคนนะ อาจเป็นเพื่อน แฟน หรือครอบครัวก็ได้ การระบาย0เป็นการที่ไม่ทำให้เราต้องแบกอะไรไว้คนเดียวนะ"<<endl;
            
            }
        cout<<"คุรเหนื่อยกับการใช้ชีวิตในตอนนี้หรือไม่"<<endl;
        cout<<"[1]ตลอด [2] นานๆครั้ง [3] ไม่เป็น"<<endl;
        cin>>ans;
        if(ans==1){
            cout<< "การพักบ้าง ไม่ใช่แปลว่าคุณขี้เกียจหรือไม่เต็มที่กับมันนะ เหนื่อยก็พักบ้าง อย่ากดดันตัวเอง"<<endl;
        }
        else if(ans==2){
            cout<< "[เหนื่อยก็พักบ้างนะ อย่าฝืนตัวเองมาก รักตัวเองเยอะๆนะ]"<<endl;

        }
        else if(ans==3){
            cout << "แสดงว่าคุณเข้มแข็งมาก เก่งมากๆเลย"<<endl;
            
        }
        cout << "คุณลองทำแบบทดสอบโรคซึมเศร้าดูมั้ย"<<endl;
        cout<< "[1]ลองทำดู [2]ไม่อะ" <<endl;
        cin >>ans;



        }

    }
    
    else if(ans==2){


    }
    }
